[
    {
        "url":"https://tkouleris.eu/blog/webcheck",
        "category":"utilities",
        "title":"WebCheck: Discover What Hackers Know About Your Site",
        "image":"https://tkouleris.eu/img/blog/webcheck/webcheck.jpg",
        "date":"19 Jan. 2025",
        "content":"                                        <p style=\"text-align:justify\">There are times when you'd like to know what all\n                                            those hackers know about your site that you might be unaware of. So, you\n                                            fire up 5-6 tools on your computer, open browser tabs with helpful sites,\n                                            and start getting lost in applications and data that you're trying to\n                                            organize somehow.</p>\n\n                                        <p style=\"text-align:justify\">But fear not! Developers from around the world\n                                            have found the solution. <b>WebCheck</b>, the app that will help you discover what\n                                            hackers know about your site — or rather, what you've allowed them to know —\n                                            all gathered in one place.</p>\n\n                                        <p style=\"text-align:justify\">All you need to do is enter your website's URL,\n                                            and within seconds, you'll know about your DNS, who has blocked you,\n                                            information about your SSL certificate, and many other things you might\n                                            never have thought to check—like your website's CO2 emissions!</p>\n\n                                        <p style=\"text-align:justify\">Live version: <a href=\"https://web-check.xyz/\">https://web-check.xyz/</a>\n                                        </p>\n\n                                        <p style=\"text-align:justify\">Source code: <a\n                                            href=\"https://github.com/Lissy93/web-check\">https://github.com/Lissy93/web-check</a>\n                                        </p>",
        "page":"webcheck",
        "description": "There are times when you'd like to know what all those hackers know about your site that you might be unaware of. So, you fire up 5-6 tools on your computer, open browser tabs with helpful sites, and start getting lost in applications and data that you're trying to organize somehow.",
        "keywords": "webcheck, security, tool, tools",
        "year": 2025
    },
    {
        "url":"https://tkouleris.eu/blog/the-ball-mouse",
        "category":"forgotten technology",
        "title":"Forgotten Technologies #5: The Ball Mouse",
        "image":"https://tkouleris.eu/img/blog/the_mouse_ball/the_ball_mouse.png",
        "date":"12 Jan. 2025",
        "content":"<h3>The First Mouse</h3>\n                                        <p style=\"text-align:justify\">\n                                            The first computer mouse was invented in 1964 by Douglas Engelbart, a\n                                            researcher at the Stanford Research Institute in the United States. The\n                                            prototype was made of wood and featured two metal wheels to detect movement\n                                            along the X and Y axes. Engelbart and his team were even awarded a patent\n                                            for the mouse in 1970.\n                                        </p>\n                                        <p style=\"text-align:justify\">\n                                            This device was first showcased in 1968 during the renowned <a\n                                            href=\"https://en.wikipedia.org/wiki/The_Mother_of_All_Demos\"\n                                            target=\"_blank\">\"The Mother of All Demos\"</a>, a historic technology\n                                            demonstration where Engelbart introduced not only the mouse but also other\n                                            innovations considered precursors to modern computers, such as graphical\n                                            user interfaces.\n                                        </p>\n                                        <p style=\"text-align:justify\">\n                                            The name \"mouse\" came from the shape of the device and its cable, which\n                                            resembled a tail. In the following decades, mouse technology advanced\n                                            significantly, starting with the introduction of a ball for movement\n                                            tracking and later evolving into optical and laser sensors.\n                                        </p>\n                                        <br/>\n                                        <img alt=\"wooden mouse\"\n                                             style=\"height: 250px;display: block;margin-left: auto;margin-right: auto;width: 50%;\"\n                                             src=\"https://tkouleris.eu/img/blog/the_mouse_ball/wooden_mouse.jpg\"/>\n                                        <br/>\n                                        <h3>The Ball Mouse</h3>\n                                        <p style=\"text-align:justify\">The first ball mouse was developed in 1972 by Bill\n                                            English, a colleague of Douglas Engelbart. Unlike Engelbart's original\n                                            mouse, which relied on two wheels, the ball mouse used a rolling ball to\n                                            detect movement, making it more versatile and easier to use.</p>\n                                        <br/>\n                                        <h3>How the Ball Mouse Worked</h3>\n                                        <p style=\"text-align:justify\">The ball inside the mouse was typically made of\n                                            rubber and could rotate in any direction. As the user moved the mouse across\n                                            a surface, the ball rolled and rotated. This rotation was transmitted to two\n                                            rollers that tracked movement along the horizontal (X) and vertical (Y)\n                                            axes. The rollers converted the ball's mechanical motion into electrical\n                                            signals, which were then translated into cursor movement on the computer\n                                            screen.</p>\n                                        <br/>\n                                        <img alt=\"mouse sketch\"\n                                             style=\"height: 250px;display: block;margin-left: auto;margin-right: auto;width: 50%;\"\n                                             src=\"https://tkouleris.eu/img/blog/the_mouse_ball/mouse_sketch.png\"/>\n                                        <br/>\n                                        <p style=\"text-align:justify\">This ball mechanism made the mouse more practical,\n                                            as it could detect movement in any direction without restrictions. It was\n                                            also more durable and reliable than the earlier wheel-based mice, which\n                                            often encountered alignment and calibration issues. The ball mouse became\n                                            the dominant design for many years, until the advent of optical and laser\n                                            mice that no longer required physical contact with a surface.</p>\n                                        <br/>\n                                        <img alt=\"mouse circuit\"\n                                             style=\"height: 250px;display: block;margin-left: auto;margin-right: auto;width: 50%;\"\n                                             src=\"https://tkouleris.eu/img/blog/the_mouse_ball/mouse_circuit.jpg\"/>\n                                        <br/>\n                                        <h3>Limitations of Ball Mice</h3>\n                                        <p style=\"text-align:justify\">Despite their success, ball mice had several\n                                            limitations that eventually led to their replacement by optical and laser\n                                            mice.</p>\n\n                                        <ol>\n                                            <li style=\"text-align:justify\">\n                                                <b>Need for Cleaning: </b>The ball would collect dust, dirt, and debris\n                                                as it rolled across surfaces. These particles would accumulate on the\n                                                rollers and internal components, causing the mouse to lose precision and\n                                                malfunction. Regular cleaning was necessary, which was inconvenient for\n                                                users.\n                                            </li>\n                                            <li style=\"text-align:justify\">\n                                                <b>Dependence on Specific Surfaces: </b>Ball mice worked well only on\n                                                smooth and clean surfaces, such as mouse pads. Surfaces that were too\n                                                slick, rough, or glossy could interfere with the ball’s ability to roll\n                                                properly, limiting its effectiveness. Optical and laser mice overcame\n                                                this limitation by being compatible with a wider range of surfaces.\n                                            </li>\n                                            <li style=\"text-align:justify\">\n                                                <b>Limited Precision: </b>>While sufficient for early applications, the\n                                                precision of ball mice was inferior to that of modern optical and laser\n                                                mice. The mechanical nature of their design imposed limitations on the\n                                                level\n                                                of detail and responsiveness they could achieve, especially for tasks\n                                                requiring fine movements.\n                                            </li>\n                                            <li style=\"text-align:justify\">\n                                                <b>Wear and Tear of Mechanical Parts: </b>The mechanical components of\n                                                ball mice, including\n                                                the ball and rollers, experienced wear over time. This reduced their\n                                                performance and accuracy. The points of contact between the ball and\n                                                rollers\n                                                could degrade, causing the mouse to “stick” or function poorly.\n                                            </li>\n                                            <li style=\"text-align:justify\">\n                                                <b>Slower Response Times: </b>The mechanical nature of ball mice\n                                                introduced a\n                                                slight delay between movement and the corresponding cursor response.\n                                                While\n                                                not noticeable in early usage, this delay became more apparent as user\n                                                demands for speed and precision increased, especially in applications\n                                                like\n                                                gaming and graphic design.\n                                            </li>\n                                            <li style=\"text-align:justify\">\n                                                <b>Weight and Movement Resistance: </b>Ball mice were often heavier due\n                                                to their\n                                                construction, and the ball’s motion could create minor resistance,\n                                                particularly during quick movements. In contrast, optical and laser mice\n                                                are\n                                                lighter and glide more smoothly, offering a better user experience.\n                                            </li>\n                                        </ol>\n                                        <br/>\n                                        <h3>A Legacy in Computing History</h3>\n                                        <p style=\"text-align:justify\">Although ball mice were eventually replaced by\n                                            superior technologies like optical and laser mice, their impact on the\n                                            development of computing input devices is undeniable. Ball mice bridged the\n                                            gap between the mechanical limitations of early designs and the\n                                            high-performance standards of today, securing a place in the history of\n                                            computing innovation.</p>",
        "page":"the-ball-mouse",
        "description": "The first computer mouse was invented in 1964 by Douglas Engelbart, a researcher at the Stanford Research Institute in the United States. The prototype was made of wood and featured two metal wheels to detect movement along the X and Y axes. Engelbart and his team were even awarded a patent for the mouse in 1970.",
        "keywords": "mouse, mice, computer mouse, ball mouse, analog mouse",
        "year": 2025
    },
    {
        "url":"https://tkouleris.eu/blog/jwt",
        "category":"programming",
        "title":"What is JWT (JSON Web Token)?",
        "image":"https://tkouleris.eu/img/blog/blue_matrix.jpg",
        "date":"05 Jan. 2025",
        "content":"<h3>What is JWT (JSON Web Token)?</h3>\n                                        <p style=\"text-align: justify;\">The JWT (JSON Web Token) is a self-contained\n                                            means of securely transferring information between two parties. It is often\n                                            used to verify user identity in web applications.</p>\n                                        <br/>\n                                        <h3>Key Features of JWT:</h3>\n                                        <p style=\"text-align: justify;\">1. <strong>Compact:</strong> JWT is a lightweight\n                                            text format that can be easily transferred via URL (GET), POST parameters,\n                                            or HTTP headers.</p>\n                                        <p style=\"text-align: justify;\">2. <strong>Self-Contained:</strong> It includes\n                                            all necessary information to verify a user's identity and the token's\n                                            validity without needing to retrieve additional data from a database.</p>\n                                        <p style=\"text-align: justify;\">3. <strong>Secure:</strong> It can be signed\n                                            using a secret key (with the HMAC algorithm) or a public/private key pair\n                                            (with the RSA or ECDSA algorithm), ensuring that the content has not been\n                                            tampered with.</p>\n                                        <br/>\n                                        <h3>JWT Structure:</h3>\n                                        <p style=\"text-align: justify;\">A JWT consists of three parts separated by\n                                            periods (<code>.</code>):</p>\n                                        <p style=\"text-align: justify;\">1. <strong>Header:</strong> The first part\n                                            contains information about the token type and the algorithm used for its\n                                            signature (e.g., HMAC SHA256 or RSA).</p>\n                                        <p style=\"text-align: justify;\">2. <strong>Payload:</strong> The second part\n                                            contains the data we want to transfer. This can include user-related\n                                            information (such as user ID, email) and token-related data (like expiration\n                                            date).</p>\n                                        <p style=\"text-align: justify;\">3. <strong>Signature:</strong> The third part\n                                            ensures the integrity of the token. It is computed by encrypting the header\n                                            and payload with a secret key or a private key.</p>\n\n                                        <h3>Example of a JWT:</h3>\n                                        <p style=\"text-align: justify;\">\n                                            <code>\n                                                eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6InRrb3VsZXJpc0BnbWFpbC\n                                                5jb20iLCJleHBpcmF0aW9uIjoiMjAyNC0wMi0yMCAwNTo0Nzo1MS43Nzk5NzQifQ.lvibV2s\n                                                aR3X84gOeQA51bAFxdxqaxL4wOSP5UGvRQBY\n                                            </code>\n                                        </p>\n                                        <p style=\"text-align: justify;\">The above is an example of a JWT token. You can\n                                            decode and inspect it using the following website:</p>\n                                        <p style=\"text-align: justify;\"><a href=\"https://jwt.io/\" target=\"_blank\">https://jwt.io/</a>\n                                        </p>\n                                        <br/>\n                                        <h3>Decrypting the Token:</h3>\n                                        <p style=\"text-align: justify;\">To decrypt the token, you will need the secret\n                                            key:</p>\n                                        <p style=\"text-align: justify;\"><code>8c7fypDnFNcvsc8fUWPKh4lVWrhMfv</code></p>\n                                        <p style=\"text-align: justify;\">The secret key is usually stored in a\n                                            configuration file of your application. It is used to generate the JWT.</p>\n                                        <br/>\n                                        <h3>Conclusion:</h3>\n                                        <p style=\"text-align: justify;\">JWT is a flexible and powerful technology for\n                                            secure web applications, especially in environments requiring scalability\n                                            and simplicity.</p>",
        "page":"jwt",
        "description": "The JWT (JSON Web Token) is a self-contained means of securely transferring information between two parties. It is often used to verify user identity in web applications.",
        "keywords": "jwt, json web token, security",
        "year": 2025
    },
    {
        "url":"https://tkouleris.eu/blog/the-repository-pattern-java-php",
        "category":"design patterns",
        "title":"The Repository Pattern (Java / PHP)",
        "image":"https://tkouleris.eu/img/blog/blue_matrix.jpg",
        "date":"29 Dec. 2024",
        "content":"<p style=\"text-align:justify\">\n                                            The Repository Pattern is a design pattern commonly used in software development, particularly in the field of data management. Its purpose is to provide an additional abstraction layer for accessing data, ensuring that the code handling application logic remains independent of the storage system implementation.\n                                        </p><br/>\n\n                                        <h3>Repository Pattern in Java</h3>\n\n                                        <p style=\"text-align:justify\">\n                                            In Java, the Repository Pattern can be used to manage interactions with the database. Here’s an example with a <code>UserRepository</code>:\n                                        </p>\n\n                                        <pre><code class=\"language-java\">\npublic interface UserRepository {\n    User findById(int id);\n    List<User> findAll();\n    void save(User user);\n    void delete(int id);\n}\n\npublic class JdbcUserRepository implements UserRepository {\n    // JDBC implementation\n}\n\npublic class HibernateUserRepository implements UserRepository {\n    // Hibernate implementation\n}\n\npublic class UserService {\n    private final UserRepository userRepository;\n\n    public UserService(UserRepository userRepository) {\n        this.userRepository = userRepository;\n    }\n\n    public User getUserById(int id) {\n        return userRepository.findById(id);\n    }\n}\n</code></pre>\n\n                                        <p style=\"text-align:justify\">\n                                            Here, the <code>UserService</code> depends on <code>UserRepository</code> but does not know the actual implementation. This allows for easy replacement with different implementations (e.g., <code>JdbcUserRepository</code>, <code>HibernateUserRepository</code>).\n                                        </p><br/>\n\n                                        <h3>Repository Pattern in PHP</h3>\n\n                                        <p style=\"text-align:justify\">\n                                            In PHP, a similar structure can be used. Here’s an example with a <code>UserRepository</code>:\n                                        </p>\n\n                                        <pre><code class=\"language-php\">\ninterface UserRepository {\n    public function findById(int $id): User;\n    public function findAll(): array;\n    public function save(User $user): void;\n    public function delete(int $id): void;\n}\n\nclass MySqlUserRepository implements UserRepository {\n    // MySQL-specific implementation\n}\n\nclass UserService {\n    private UserRepository $userRepository;\n\n    public function __construct(UserRepository $userRepository) {\n        this->userRepository = $userRepository;\n    }\n\n    public function getUserById(int $id): User {\n        return $this->userRepository->findById($id);\n    }\n}\n</code></pre>\n\n                                        <p style=\"text-align:justify\">\n                                            Here too, <code>UserService</code> uses <code>UserRepository</code> without concerning itself with the actual implementation. This allows flexibility in replacing <code>MySqlUserRepository</code> with other implementations.\n                                        </p><br/>\n\n                                        <h3>Summary</h3>\n\n                                        <p style=\"text-align:justify\">\n                                            The Repository Pattern provides efficient data and storage management while promoting flexibility and maintainability in software development, whether in Java or PHP.\n                                        </p>",
        "page":"the-repository-pattern-java-php",
        "description": "The Repository Pattern is a design pattern commonly used in software development, particularly in the field of data management. Its purpose is to provide an additional abstraction layer for accessing data, ensuring that the code handling application logic remains independent of the storage system implementation.\n\n",
        "keywords": "repository pattern, design patterns, php, java, code",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/four-projects-for-beginners",
        "category":"programming",
        "title":"Four simple projects for beginner programmers",
        "image":"https://tkouleris.eu/img/blog/four-projects-for-beginners.png",
        "date":"22 Dec. 2024",
        "content":"<p style=\"text-align: justify;\">\n                                            If you're starting your journey into the world of programming, it's\n                                            important to choose projects that will help enhance your skills. Here are\n                                            four project ideas for beginner programmers, along with the technologies and\n                                            techniques you can use for each:\n                                        </p><br/>\n                                        <h3 style=\"text-align:justify;\">Shopping List App</h3>\n                                        <p style=\"text-align:justify;\">\n                                            You can create a shopping list application using programming languages like\n                                            Python, JavaScript, or PHP. For app development, you can use technologies\n                                            such as HTML, CSS, and JavaScript, along with a simple back-end framework\n                                            like Flask, Express, or Laravel. You’ll also need a database such as\n                                            MariaDB, MySQL, or even SQLite.\n                                        </p>\n\n                                        <h3 style=\"text-align:justify;\">Image Collection</h3>\n                                        <p style=\"text-align:justify;\">\n                                            Build an application that allows users to upload images and organize them\n                                            into albums. You can include features for viewing, editing, and deleting\n                                            images, as well as creating albums for photo organization. The back-end\n                                            implementation can again be done using Python, JavaScript, or PHP, along\n                                            with a database like MariaDB, MySQL, or SQLite.\n                                        </p><br/>\n\n                                        <h3 style=\"text-align:justify;\">Task Calendar</h3>\n                                        <p style=\"text-align:justify;\">\n                                            Develop a simple calendar app that enables users to schedule and manage\n                                            their daily tasks. You can use programming languages like Python, Java, or\n                                            JavaScript to build the application, and frameworks such as Flask or Spring\n                                            Boot for the back-end. For the front-end, you might use a library like\n                                            <a href=\"https://fullcalendar.io/\" target=\"_blank\">FullCalendar</a>.\n                                        </p><br/>\n\n                                        <h3 style=\"text-align:justify;\">Currency Converter</h3>\n                                        <p style=\"text-align:justify;\">\n                                            Create a simple application that converts currency values from one unit to\n                                            another. You can use free <a href=\"https://exchangeratesapi.io/\"\n                                                                         target=\"_blank\">API</a> to fetch current\n                                            exchange rates and implement\n                                            the functionality using languages like Python or JavaScript.\n                                        </p><br/>\n                                        <p style=\"text-align:justify;\">\n                                            These project ideas can help beginner programmers develop their skills and\n                                            understand fundamental programming concepts. Happy Coding! 😊\n                                        </p>",
        "page":"four-projects-for-beginners",
        "description": "If you're starting your journey into the world of programming, it's essential to choose projects that will help enhance your skills. Here are four project ideas for beginner programmers, along with the technologies and techniques you can use for each of them",
        "keywords": "junior programmer, beginner, simple projects",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/immutable-databases",
        "category":"sql",
        "title":"Immutable Databases: A Paradigm for Trust and Data Integrity",
        "image":"https://tkouleris.eu/img/blog/immutable-databases.jpg",
        "date":"15 Dec. 2024",
        "content":"<p style=\"text-align: justify;\">In the ever-evolving landscape of data\n                                            management, one concept is gaining traction for its potential to redefine\n                                            how we think about data security, integrity, and trust: immutable databases.\n                                            These databases, by design, ensure that once data is written, it cannot be\n                                            altered or deleted. Instead of the traditional approach to data management\n                                            where records can be updated or overwritten, immutable databases append\n                                            changes, maintaining a verifiable and permanent record of all transactions\n                                            or updates.</p>\n                                        <br/>\n                                        <h3>The Core Concept of Immutability</h3>\n\n                                        <p style=\"text-align: justify;\">Immutability in databases originates from the\n                                            principle of \"write-once-read-many\" (WORM). Unlike traditional relational or\n                                            non-relational databases, immutable databases use data structures that\n                                            maintain the history of data. This means that every state of the database is\n                                            preserved, and the system creates a new version of the data for every\n                                            modification.</p>\n\n                                        <p style=\"text-align: justify;\">The immutable model offers several key\n                                            advantages:</p>\n\n                                        <ul style=\"text-align: justify;\">\n                                            <li><strong>Auditability</strong>: Since data cannot be overwritten or\n                                                deleted, immutable databases create a complete, verifiable history of\n                                                changes. This feature is particularly beneficial for industries like\n                                                finance, healthcare, and legal systems, where transparency and\n                                                accountability are paramount.\n                                            </li>\n                                            <li><strong>Enhanced Security</strong>: Immutable databases significantly\n                                                reduce the risk of malicious data tampering. Cyberattacks aimed at\n                                                altering data post-entry, such as ransomware or insider threats, are\n                                                rendered ineffective.\n                                            </li>\n                                            <li><strong>Data Integrity</strong>: The inability to alter or delete data\n                                                ensures the consistency and reliability of stored information, making it\n                                                ideal for mission-critical applications.\n                                            </li>\n                                        </ul>\n                                        <br/>\n                                        <h3>Technologies Behind Immutable Databases</h3>\n\n                                        <p style=\"text-align: justify;\">The rise of immutable databases is closely\n                                            linked to advancements in blockchain and distributed ledger technologies\n                                            (DLTs). Blockchain systems, such as Bitcoin or Ethereum, are prime examples\n                                            of immutable databases. These systems append data to a chain of blocks\n                                            secured by cryptographic hashes, making it virtually impossible to alter\n                                            past entries without invalidating the entire chain.</p>\n\n                                        <p style=\"text-align: justify;\">However, immutable databases are not limited to\n                                            blockchain. Several database systems have implemented immutability\n                                            principles in more traditional database contexts:</p>\n\n                                        <ul style=\"text-align: justify;\">\n                                            <li><strong>Event Sourcing</strong>: In event-sourced systems, every state\n                                                change is recorded as an event. These events are immutable and are\n                                                stored sequentially, allowing the system to reconstruct any previous\n                                                state.\n                                            </li>\n                                            <li><strong>Immutable Log-Based Storage</strong>: Systems like Apache Kafka\n                                                store data as immutable logs, which provide a reliable record of events\n                                                over time.\n                                            </li>\n                                            <li><strong>Versioned Databases</strong>: Tools like Datomic and\n                                                FoundationDB provide versioning capabilities, preserving historical\n                                                states alongside current ones.\n                                            </li>\n                                        </ul>\n                                        <br/>\n                                        <h3>Use Cases of Immutable Databases</h3>\n\n                                        <p style=\"text-align: justify;\">Immutable databases have diverse applications,\n                                            including:</p>\n\n                                        <ul style=\"text-align: justify;\">\n                                            <li><strong>Compliance and Regulatory Requirements</strong>: Immutable\n                                                databases are invaluable in sectors with strict regulatory requirements,\n                                                such as finance and healthcare. They provide the transparency and\n                                                traceability needed for compliance with standards like GDPR, HIPAA, or\n                                                SOX.\n                                            </li>\n                                            <li><strong>Fraud Detection and Prevention</strong>: By maintaining an\n                                                unalterable history of transactions, immutable databases can help detect\n                                                and prevent fraud. Any attempt to manipulate data can be immediately\n                                                identified.\n                                            </li>\n                                            <li><strong>Scientific Research</strong>: In fields like genomics or climate\n                                                modeling, maintaining the integrity of research data is crucial.\n                                                Immutable databases ensure that raw data and analyses remain unchanged\n                                                over time, fostering reproducibility and trust.\n                                            </li>\n                                            <li><strong>Supply Chain Management</strong>: Immutable databases enable\n                                                enhanced tracking and verification of goods across complex supply\n                                                chains. Blockchain-based solutions, for example, can confirm the\n                                                authenticity of products and trace their journey from origin to\n                                                consumer.\n                                            </li>\n                                        </ul>\n                                        <br/>\n                                        <h3>Challenges and Considerations</h3>\n\n                                        <p style=\"text-align: justify;\">Despite their advantages, immutable databases\n                                            are not without challenges:</p>\n\n                                        <ul style=\"text-align: justify;\">\n                                            <li><strong>Storage Overhead</strong>: Since data is never deleted or\n                                                overwritten, the storage requirements of immutable databases can grow\n                                                significantly over time. Efficient compression and archival strategies\n                                                are essential.\n                                            </li>\n                                            <li><strong>Complexity</strong>: Implementing and maintaining an immutable\n                                                database requires careful planning, especially when integrating with\n                                                existing systems.\n                                            </li>\n                                            <li><strong>Performance</strong>: Writing data in an immutable fashion can\n                                                introduce latency, especially in high-throughput environments.\n                                                Optimizations like batching and asynchronous writes can help mitigate\n                                                this.\n                                            </li>\n                                        </ul>\n                                        <br/>\n                                        <h3>The Future of Immutable Databases</h3>\n\n                                        <p style=\"text-align: justify;\">As organizations continue to prioritize data\n                                            security and integrity, immutable databases are likely to play an\n                                            increasingly prominent role. Innovations in storage efficiency,\n                                            cryptographic techniques, and distributed systems are expected to address\n                                            many of the current limitations, making these databases more accessible and\n                                            performant.</p>\n\n                                        <p style=\"text-align: justify;\">Moreover, the rise of data-centric regulations\n                                            and the growing importance of digital trust signal a broader shift towards\n                                            systems that emphasize transparency and immutability. For businesses looking\n                                            to stay ahead in this era of accountability, adopting immutable database\n                                            technologies may no longer be an option but a necessity.</p>\n\n                                        <p style=\"text-align: justify;\">In conclusion, immutable databases represent a\n                                            powerful tool for organizations aiming to build robust, secure, and\n                                            transparent data systems. While challenges remain, their benefits in terms\n                                            of trust, compliance, and data integrity are undeniable, making them a\n                                            cornerstone of the future of data management.</p>",
        "page":"immutable-databases",
        "description": "An immutable database ensures data cannot be altered or deleted, preserving append-only records for transparency, integrity, and auditability.",
        "keywords": "immutable database, blockchain database, append-only database, write-once-read-many (worm) database, event-sourced database, immutable data storage, data immutability, tamper-proof database, versioned database systems, cryptographic data integrity, audit trail database, immutable logs, secure data storage, what is an immutable database?, benefits of immutable databases, immutable database for compliance and audit, how immutable databases work, blockchain vs traditional databases, event sourcing with immutable databases, best immutable database solutions, financial transaction immutability, immutable healthcare records, supply chain immutable ledger, tamper-proof data for legal compliance",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/composite-pattern",
        "category":"design patterns",
        "title":"Composite Pattern",
        "image":"https://tkouleris.eu/img/blog/blue_matrix.jpg",
        "date":"08 Dec. 2024",
        "content":"<p>The <b>Composite Design Pattern</b> is a structural pattern used to represent part-whole hierarchies. It allows you to treat individual objects and compositions of objects uniformly, enabling a tree structure to represent complex object hierarchies.</p>\n                          <p>\n                            The Composite Design Pattern consists of three pillars:\n                            <ul>\n                              <li>When your application requires a tree structure to represent hierarchies of objects.</li>\n                              <li>When you want to treat individual objects and composite objects uniformly.</li>\n                              <li>When operations on nodes in a hierarchy should work in the same way for leaves and composites.</li>\n                            </ul>                            \n                          </p>\n                          <p>\n                            You can use the Composite Design Pattern when your application requires a tree structure to represent hierarchies of objects, when you want to treat individual objects and composite objects uniformly, or when operations on nodes in a hierarchy should work in the same way for leaves and composites.\n                          </p>\n                          <h4>UML</h4>\n                          <img src=\"https://tkouleris.eu/img/blog/composite-pattern-1.png\" />\n                          <h4>Example In Java</h4>\n                          <img src=\"https://tkouleris.eu/img/blog/composite-pattern-java.png\" />\n                          <h4>Example In Python</h4>\n                          <img src=\"https://tkouleris.eu/img/blog/composite-pattern-python.png\" />\n                          <h4>Advantages and Disadvantages of the Pattern</h4>\n                          <p>The Composite Design Pattern provides an elegant way to represent and work with tree structures. It simplifies client code by allowing uniform treatment of both individual (leaf) and composite objects. This uniformity makes it easier to perform operations on entire hierarchies without needing to distinguish between leaf and composite objects explicitly. Furthermore, the pattern promotes flexibility by enabling new types of components to be introduced with minimal changes to existing code, making the design more extensible and easier to maintain.</p>\n                          <p>However, the pattern is not without its downsides. Managing complex component hierarchies can add overhead, especially if the tree structure is large or frequently modified. Additionally, the uniform treatment of objects might lead to overly generic interfaces that don’t adequately represent specific behaviors of individual components. If the application does not naturally require a hierarchical structure, implementing the Composite Pattern can result in unnecessary complexity.</p>\n                          <h4>Final</h4>\n                          <p>The Composite Design Pattern simplifies the management of complex hierarchical object structures. Whether working in Java or Python, implementing this pattern can significantly enhance code reusability and maintainability. By abstracting operations and managing components uniformly, you can handle intricate part-whole relationships effectively.</p>\n                          <p>The Composite Design Pattern simplifies the management of complex hierarchical object structures. Whether working in Java or Python, implementing this pattern can significantly enhance code reusability and maintainability. By abstracting operations and managing components uniformly, you can handle intricate part-whole relationships effectively.</p>\n                          <iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/EWDmWbJ4wRA?si=XDQ_Bx1uOmv6rVbo\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n                        ",
        "page":"composite-pattern",
        "description": "The Composite Design Pattern is a structural pattern used to represent part-whole hierarchies",
        "keywords": "design pattern, composite design pattern, code, clean code, algorithms",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/open-source-conspiracy",
        "category":"misc",
        "title":"The Open Source conspiracy",
        "image":"https://tkouleris.eu/img/blog/open-source-conspiracy.png",
        "date":"01 Dec. 2024",
        "content":"<p>A conspiracy theory I came up with last night goes as follows: free software and open-source software exist so that large corporations can use software they would otherwise have to spend significant amounts of money to purchase or develop.</p><p>The truth is that software companies like Microsoft have often fought against open-source and free software. But is that enough to claim that the philosophy of free code (from now on, by \"free code,\" I mean both free software and open-source software) doesn't \"suit\" them? Certainly, it doesn't benefit a company directly if a new competitor emerges for its office suite, such as OpenOffice or LibreOffice, especially if the company sells its own suite. However, this isn't the software we’re talking about here.</p><p>Let’s consider software like Linux. For a company like Microsoft to develop such software would require significant time and money. Of course, they could invest some funds to make it \"compatible\" with other software they sell, but even then, the cost wouldn't be the same. Especially if they use Linux on some of their cloud platforms, the cost for the company is almost zero, and they would keep most of the revenue from the service, perhaps only deducting maintenance costs.</p><p>Another example is the Edge browser. Microsoft cleverly used the open-source Chromium code to release its own browser, leaving behind the outdated Internet Explorer. Creating a new browser from scratch with the security and features Google had developed would have been difficult and costly.</p><p>Perhaps this is why, in recent years, companies have stopped fighting against free code and joined the game instead. It has become evident that free code benefits companies—especially large corporations. How else could Microsoft have developed Copilot without access to a vast pool of code to train its new tool?</p><p>Thus, it seems that free code might be a grand \"conspiracy\" to allow large companies access to cheaper software—or even code—so they can generate greater profits at the lowest possible cost. Of course, this is just a conspiracy theory, one of those fleeting thoughts that come to you just before drifting off to sleep, and its value is about as significant as that of Internet Explorer.</p>",
        "page":"open-source-conspiracy",
        "description": "A conspiracy theory I came up with last night goes as follows: free software and open-source software exist so that large corporations can use software they would otherwise have to spend significant amounts of money to purchase or develop.",
        "keywords": "open source, conspiracy, office, microsoft, libre office, open office",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/donkey-kong-country-behind-the-scenes",
        "category":"video games",
        "title":"When Rare was eating bananas",
        "image":"https://tkouleris.eu/img/blog/donkey-kong-country-behind-the-scenes.jpg",
        "date":"24 Nov. 2024",
        "content":"                                        <p style=\"text-align: justify;\">\n                                            Several years ago, back when I was still uploading videos to YouTube, I did\n                                            a review of <b>Donkey Kong Country</b>, one of the best games for the SNES. Of\n                                            course, my effort wasn’t aimed at recording the historical details of DKC’s\n                                            development but rather at presenting my subjective opinion of the game.\n                                        </p>\n                                        <p style=\"text-align: justify;\">\n                                            Naturally, when someone has more resources and, most importantly, the game’s\n                                            actual creators talking about it, the quality of the final product is much\n                                            better. That’s exactly the case with DF Retro’s video about the game. The\n                                            video is a documentary on the creation of Donkey Kong Country and runs just\n                                            under 50 minutes. Enjoy!\n                                        </p>\n                                        <br/>\n                                        <iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/GQ7qtqqgTlo?si=hoqI_o283XolJenn\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n                                        <br/><br/>\n                                        <p style=\"text-align: justify;\">\n                                            Of course, for historical reasons, I’m also including my own video (what a show-off):\n                                        </p>\n                                        <iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/OHlACXYiaE4?si=4nSgwVbME7ILhOr3\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
        "page":"donkey-kong-country-behind-the-scenes",
        "description": "Several years ago, back when I was still uploading videos to YouTube, I did a review of Donkey Kong Country, one of the best games for the SNES. Of course, my effort wasn’t aimed at recording the historical details of DKC’s development but rather at presenting my subjective opinion of the game.",
        "keywords": "donkey kong, rare, donkey kong country, snes, super nintendo, 16 bit",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/bubble-sort",
        "category":"sorting algorithms",
        "title":"Sorting Algorithms #1: Bubble Sort",
        "image":"https://tkouleris.eu/img/blog/code.jpg",
        "date":"17 Nov. 2024",
        "content":"<style>\n                                            body {\n                                                font-family: Arial, sans-serif;\n                                                line-height: 1.6;\n                                            }\n                                            pre {\n                                                background-color: #f4f4f4;\n                                                padding: 10px;\n                                                border-radius: 5px;\n                                                border: 1px solid #ddd;\n                                                overflow-x: auto;\n                                                color: #0b0b0b;\n                                            }\n                                            code {\n                                                font-family: Consolas, \"Courier New\", monospace;\n                                            }\n                                        </style>\n                                        <!-- Start -->\n                                        <h3>What are Sorting Algorithms?</h3>\n                                        <p style=\"text-align: justify\">\n                                            Sorting algorithms are a set of algorithms that help us arrange data in\n                                            ascending or descending order. They are fundamental to computer science, and\n                                            the differences between them mainly lie in their time complexity and space\n                                            complexity, which determine their suitability for handling larger\n                                            datasets.</p><br/>\n                                        <h3>Bubble Sort</h3>\n                                        <p style=\"text-align: justify\">\n                                            The simplest and, at the same time, the worst sorting algorithm is Bubble\n                                            Sort. In Bubble Sort, we start from the beginning of the dataset and compare\n                                            the first two elements. The smaller one is placed first, and the larger one\n                                            second. Then, we compare the next two elements and repeat the process. This\n                                            continues until all elements are compared. Once a full pass is complete, the\n                                            process is repeated from the start until the dataset is fully sorted.</p>\n\n                                        <p style=\"text-align: justify\">\n                                            For example, consider the array [10, 4, 5, 8, 0]. To execute the algorithm:\n\n                                            Compare 10 with 4. Since 4 is smaller, the array becomes [4, 10, 5, 8, 0].\n                                            Compare 10 with 5. Since 5 is smaller, the array becomes [4, 5, 10, 8, 0].\n                                            Compare 10 with 8. Since 8 is smaller, the array becomes [4, 5, 8, 10, 0].\n                                            Compare 10 with 0. Since 0 is smaller, the array becomes [4, 5, 8, 0, 10].\n                                            This completes the first pass. The process is repeated until the array is\n                                            fully sorted.</p><br/>\n                                        <h3>Code</h3>\n                                        <pre><code>\ndef bubble_sort(arr):\n    n = len(arr)\n    # Traverse through all array elements\n    for i in range(n):\n        # Last i elements are already sorted, no need to check them\n        for j in range(0, n-i-1):\n            # Swap if the element found is greater than the next element\n            if arr[j] > arr[j+1]:\n                arr[j], arr[j+1] = arr[j+1], arr[j]\n    return arr\n\n# Example usage\ndata = [10, 4, 5, 8, 0]\nsorted_data = bubble_sort(data)\nprint(\"Sorted array:\", sorted_data)\n    </code></pre><br/>\n\n                                        <h3>Algorithm Complexity</h3>\n                                        <p style=\"text-align: justify;\">\n                                            The time complexity of Bubble Sort is <span\n                                            style=\"font-family: 'Times New Roman', serif;\">O(n<sup>2</sup>)</span> in\n                                            the worst case, where <i>n</i> is the number of elements. This makes the\n                                            algorithm unsuitable for large datasets.</p>",
        "page":"bubble-sort",
        "description": "",
        "keywords": "bubble sort, algorithm, sorting algorithms, python",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/three-rules-for-readable-code",
        "category":"code",
        "title":"Three (3) rules for readable code",
        "image":"https://tkouleris.eu/img/blog/blue_matrix.jpg",
        "date":"10 Nov. 2024",
        "content":"<style>\n\n                                            pre {\n                                                background-color: #f4f4f4;\n                                                padding: 10px;\n                                                border-radius: 5px;\n                                                border: 1px solid #ddd;\n                                                overflow-x: auto;\n                                                color: #0b0b0b;\n                                            }\n\n                                            code {\n                                                font-family: Consolas, \"Courier New\", monospace;\n                                            }\n                                        </style>\n                                        <h3>1. Avoid Deeply Nested Code</h3>\n                                        <p style=\"text-align: justify;\">\n                                            It’s common, especially among newer developers, to try to handle one case\n                                            inside another and then handle yet another case within that, and so on.</p>\n\n                                        <b>Example:</b>\n                                        <pre><code>\nif condition1:\n    if condition2:\n        if condition3:\n            # Do something\n\n                                        </code></pre>\n                                        <p style=\"text-align: justify;\">\n                                            In this scenario, anyone trying to read the code will struggle\n                                            significantly.\n                                            Every time they encounter an if, they need to remember where they are and\n                                            why. This makes the code harder to read and more difficult to\n                                            understand.</p>\n                                        <b>A Better Approach:</b>\n                                        <pre><code>\nif not condition1:\n    return\n\nif not condition2:\n    return\n\nif not condition3:\n    return\n\n# Do something\n\n                                        </code></pre>\n                                        <p style=\"text-align: justify;\">\n                                            To make the above code more readable, we created a helper function and\n                                            utilized the early return technique. If data is missing, we return. If the\n                                            user is inactive, we return. If the user’s profile doesn’t exist, we return.\n                                            This way, the code becomes more readable and easier for the reader to follow\n                                            without overloading their memory.\n                                        </p><br/>\n                                        <h3>2. Extract Variable Checks into Functions</h3>\n                                        <p style=\"text-align: justify;\">\n                                            In many cases, variable checks can make code harder to read, requiring you\n                                            to keep track of what each variable does. A simple way to make your code\n                                            read like plain text is to extract variable checks into functions. For\n                                            example:\n                                        </p>\n\n                                        <b>Before:</b>\n                                        <pre><code>\nif data.users.length > 0:\n    # Do something\n\n                                        </code></pre>\n                                        <b>After:</b>\n                                        <pre><code>\ndef has_users(data):\n    return len(data.users) > 0\n\nif has_users(data):\n    # Do something\n\n                                        </code></pre>\n                                        <p style=\"text-align: justify;\">\n                                            In the above block, we created the has_users function. This allows the\n                                            reader to interpret the code as “if the data has users” rather than\n                                            deciphering what data.users.length means.\n                                        </p><br/>\n                                        <h3>3. Avoid Code Duplication</h3>\n                                        <p style=\"text-align: justify;\">\n                                            In programming, it’s important not to write the same code repeatedly. This\n                                            can simplify future changes to the code. For example, what if you needed to\n                                            change the text from \"User is active and\" to \"Client is available and\"?\n                                            While this might only appear in two lines in a small example, in a\n                                            real-world application, such a string might be duplicated across 10 or 20\n                                            places. You’d need to find and modify the string in all of those instances.\n                                            Instead, you can use a function to handle this centrally.\n                                        </p>\n\n                                        Example:\n                                        <pre><code>\ndef log_user_status(user):\n    print(f\"{user.name} is active and {user.status}\")\n\n                                        </code></pre>\n                                        <p style=\"text-align: justify;\">\n                                            By using this function, you only need to update the logic in one place if\n                                            changes are required.</p><br/>\n                                        <h3>Final Code with All Three Improvements:</h3>\n                                        <pre><code>\ndef has_users(data):\n    return len(data.users) > 0\n\ndef log_user_status(user):\n    print(f\"{user.name} is active and {user.status}\")\n\ndef process_data(data):\n    if not data:\n        return\n\n    if not data.is_active:\n        return\n\n    if not has_users(data):\n        return\n\n    for user in data.users:\n        log_user_status(user)\n\n                                        </code></pre>\n                                        <br/>\n                                        <h3>Why These Rules Are Important</h3>\n                                        <p style=\"text-align: justify;\">\n                                            These three rules are crucial for writing readable code and making future\n                                            changes easier. Even code we wrote today might be hard to remember after\n                                            three years when modifications are required. If we don’t structure the code\n                                            to be navigable and readable, we will spend more time developing new\n                                            features or fixing bugs.</p>",
        "page":"three-rules-for-readable-code",
        "description": "How to make your code more readable? Follow the three simple rules",
        "keywords": "code, readable, nested if, code duplication, extract checks",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/antitrust",
        "category":"computer science movies",
        "title":"Computer Science Movies #1: Antitrust",
        "image":"https://tkouleris.eu/img/blog/antitrust.jpg",
        "date":"03 Nov. 2024",
        "content":"<p style=\"text-align: justify;\">\n                                            The movie Antitrust (2001) is a tech thriller focusing on Milo Hoffman, a\n                                            young and talented computer programmer. Milo is recruited by NURV, one of\n                                            the world's largest software companies, led by the charismatic and powerful\n                                            Gary Winston. Initially impressed by the opportunity and the cutting-edge\n                                            work environment, Milo soon discovers that NURV is involved in illegal\n                                            activities, including intellectual property theft and the murder of those\n                                            who resist.\n                                        </p>\n                                        <p style=\"text-align: justify;\">\n                                            As Milo digs deeper, he uncovers a sinister plan exploiting open-source\n                                            software\n                                            and developers to give Winston complete control over global software. Milo\n                                            must\n                                            decide whether to stay true to his ethics or submit to the company's\n                                            pressures,\n                                            putting his life and the lives of his loved ones at risk. The film explores\n                                            themes of ethics in technology, software freedom, and manipulation by large\n                                            multinational corporations.\n                                        </p>\n                                        <p style=\"text-align: justify;\">\n                                            I watched this movie as a student, on a Friday afternoon when I wanted to\n                                            see\n                                            something tech-related. Since then, it has become my number one film related\n                                            to\n                                            computer science and programming. This is due to its many references to\n                                            open-source software, scenes showcasing real operating systems from various\n                                            Linux distributions, and the movie’s motivational phrase: \"Human knowledge\n                                            belongs to the world.\" At the time, I was not only trying to figure out\n                                            which\n                                            area of technology and computer science I would pursue, but it also\n                                            coincided\n                                            with the period when I was shaping my political ideology, which was greatly\n                                            influenced by open and free software.\n                                        </p>\n                                        <p style=\"text-align: justify;\">\n                                            It’s certainly not an Oscar-worthy film with deep meanings, profound\n                                            philosophy,\n                                            or stellar performances, but if you’ve gone through a phase of being into\n                                            free\n                                            software, it will definitely leave an impression.\n                                        </p><br/>\n                                        <h3>Details:</h3>\n                                        <a href=\"https://www.imdb.com/title/tt0218817/?ref_=fn_al_tt_1\" target=\"_blank\">Antitrust\n                                            (2001)</a>\n                                        <br/>\n                                        <b>Director:</b> <a href=\"https://www.imdb.com/name/nm0398185/?ref_=tt_ov_dr_1\"\n                                                            target=\"_blank\">Peter Howitt</a><br/>\n                                        <b>Writer:</b> <a href=\"https://www.imdb.com/name/nm0291442/?ref_=tt_ov_wr_1\"\n                                                          target=\"_blank\">Howard Franklin</a><br/>\n                                        <b>Music:</b> <a\n                                        href=\"https://www.imdb.com/name/nm0204485/?ref_=nv_sr_srsg_3_tt_0_nm_8_in_0_q_Don%2520Davis\"\n                                        target=\"_blank\">Don Davis</a><br/>\n                                        <b>Starring:</b>\n                                        <p style=\"text-align: justify;\">\n                                            <a href=\"https://www.imdb.com/name/nm0000202/?ref_=tt_cl_t_1\"\n                                               target=\"_blank\">Ryan Phillippe</a> (Milo Hoffman), <a\n                                            href=\"https://www.imdb.com/name/nm0000209/?ref_=tt_cl_t_2\" target=\"_blank\">Tim\n                                            Robbins</a> (Gary Winston),\n                                            <a href=\"https://www.imdb.com/name/nm0000337/?ref_=tt_cl_t_3\" target=\"_blank\">Rachael Leigh Cook</a> (Lisa Calighan),\n                                            <a href=\"https://www.imdb.com/name/nm0001231/?ref_=tt_cl_t_4\" target=\"_blank\">Claire Forlani</a> (Alice Poulson)\n                                        </p>",
        "page":"antitrust",
        "description": "A computer programmer's dream job at a hot Portland-based firm turns nightmarish when he discovers his boss has a secret and ruthless means of dispatching anti-trust problems.",
        "keywords": "movie, antitrust, tech, open source, computer science movies",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/sql-indexes",
        "category":"sql",
        "title":"SQL Indexes",
        "image":"https://tkouleris.eu/img/blog/sql.png",
        "date":"27 Oct. 2024",
        "content":"<style>\n\n                                            pre {\n                                                background-color: #f4f4f4;\n                                                padding: 10px;\n                                                border-radius: 5px;\n                                                border: 1px solid #ddd;\n                                                overflow-x: auto;\n                                                color: #0b0b0b;\n                                            }\n\n                                            code {\n                                                font-family: Consolas, \"Courier New\", monospace;\n                                            }\n                                        </style>\n                                        <h3>What is an SQL Index?</h3>\n                                        <p style=\"text-align: justify;\">\n                                            Indexes in SQL are data structures that help us retrieve data from a\n                                            database\n                                            more quickly. They can be compared to the table of contents of a book. For\n                                            example, if you have a book about C programming and you want to learn about\n                                            pointers, you don’t need to read the entire book to find the relevant\n                                            chapter. You look at the table of contents, see that the chapter on pointers\n                                            is on page 110, and go directly there. SQL indexes work in a similar\n                                            way.</p>\n\n                                        <p style=\"text-align: justify;\">\n                                            You create indexes on a column of a database table. When you run a query\n                                            based on that column, the SQL engine can return results faster using the\n                                            index.\n                                        </p><br/>\n\n                                        <h3>How SQL Indexes Work</h3>\n                                        <p style=\"text-align: justify;\">\n                                            The most common data structure for SQL indexes is the B-Tree, also known as\n                                            a Balanced Tree. In this data structure, each leaf of the tree can have more\n                                            than\n                                            one key. For instance, if each leaf has two keys, it will have three\n                                            branches:\n                                        </p>\n\n                                        <p style=\"text-align: justify;\">\n                                            The left branch contains values smaller than the left key.\n                                            The middle branch contains values between the left and right keys.\n                                            The right branch contains values greater than the right key.\n                                            A more detailed analysis of balanced trees can be found here:\n                                        </p><br/>\n                                        <iframe width=\"560\" height=\"315\"\n                                                src=\"https://www.youtube.com/embed/K1a2Bk8NrYQ?si=llNqG0apsqwVF7Hv\"\n                                                title=\"YouTube video player\" frameborder=\"0\"\n                                                allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"\n                                                referrerpolicy=\"strict-origin-when-cross-origin\"\n                                                allowfullscreen></iframe>\n                                        <br/><br/><br/>\n\n                                        <h3>Types of SQL Indexes</h3>\n                                        <br/>\n                                        <h4>Clustered Indexes:</h4>\n\n                                        <p style=\"text-align: justify;\">\n                                            A clustered index determines the physical order of data in a table. This\n                                            means that the rows are stored on the disk in the same order as the index. A\n                                            table can have only one clustered index, as rows can be sorted in only one\n                                            way. Clustered indexes are typically created based on the primary key of the\n                                            table.</p>\n                                        <p>Example:</p>\n                                        <pre><code>\nCREATE CLUSTERED INDEX idx_employee_id ON Employees(EmployeeID);\n                                        </code></pre>\n                                        <br/>\n                                        <h4>Non-Clustered Indexes:</h4>\n                                        <p style=\"text-align: justify;\">\n                                            A non-clustered index is independent of the table's data. It contains a\n                                            sorted list of values from the indexed columns and pointers that reference\n                                            the actual rows in the table. Unlike clustered indexes, a table can have\n                                            multiple non-clustered indexes.</p>\n                                        <p>Example:</p>\n                                        <pre><code>\nCREATE NONCLUSTERED INDEX idx_employee_name ON Employees(LastName);\n                                        </code></pre>\n                                        <br/>\n                                        <p style=\"text-align: justify;\">\n                                            A more detailed comparison between clustered and non-clustered indexes for\n                                            SQL Server can be found here:</p>\n                                        <iframe width=\"560\" height=\"315\"\n                                                src=\"https://www.youtube.com/embed/ITcOiLSfVJQ?si=baPNh7XqOSh1DT0V\"\n                                                title=\"YouTube video player\" frameborder=\"0\"\n                                                allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"\n                                                referrerpolicy=\"strict-origin-when-cross-origin\"\n                                                allowfullscreen></iframe>\n                                        <br/><br/><br/>\n                                        <h4>Unique Indexes:</h4>\n                                        <p style=\"text-align: justify;\">\n                                            A unique index ensures that the values in the column or columns that are\n                                            indexed are unique. This type of index is often used to enforce data\n                                            uniqueness, similar to a unique constraint.</p>\n                                        <p>Example:</p>\n                                        <pre><code>\nCREATE UNIQUE INDEX idx_unique_email ON Employees(Email);\n                                        </code></pre>\n                                        <br/>\n                                        <h4>Full-Text Indexes:</h4>\n                                        <p style=\"text-align: justify;\">\n                                            A full-text index is used to perform full-text searches, which involve\n                                            searching for words or phrases within large text columns. This type of index\n                                            is ideal for applications such as search engines or document management\n                                            systems.</p>\n                                        <p>Example:</p>\n                                        <pre><code>\nCREATE FULLTEXT INDEX idx_fulltext_description ON Products(Description);\n                                        </code></pre>\n                                        <br/>\n                                        <h3 style=\"margin-bottom: 10px;\">When to Use Indexes</h3>\n                                        <ol >\n                                            <li style=\"margin-bottom: 10px;\">\n                                                <b>Right Column Rule:</b> Create an index on a column that is frequently used\n                                                in queries with WHERE, JOIN, or ORDER BY clauses.<br/>\n                                            </li>\n\n                                            <li style=\"margin-bottom: 10px;\">\n                                                <b>Index Limitation Rule:</b> Excessive use of indexes can have the opposite\n                                                effect of what we expect. This is because more indexes increase the time\n                                                required for INSERT operations and also increase the database size.\n                                            </li>\n\n                                            <li style=\"margin-bottom: 10px;\">\n                                                <b>Type of Data:</b> The type of data being indexed is very important. For\n                                                example, integers perform better when indexed.\n                                            </li>\n\n                                            <li style=\"margin-bottom: 10px;\">\n                                                <b>No Indexes on Small Tables:</b> If the table is small, a full scan might be\n                                                faster for finding a record than creating indexes.\n                                            </li>\n                                        </ol>\n                                        <br/>\n                                        <p style=\"text-align: justify;\">\n                                            Using indexes in a database is a critical tool that can significantly enhance\n                                            data retrieval speed. However, it is essential to identify which data is\n                                            worth indexing, avoiding a situation where all columns in all tables are\n                                            indexed, which could lead to adverse results.</p>",
        "page":"sql-indexes",
        "description": "SQL (Structured Query Language) is a standardized programming language designed to manage and manipulate relational databases. It allows users to perform a wide range of operations on data, such as querying, updating, inserting, and deleting data stored in a database.",
        "keywords": "sql, sql index, sql indexes, microsoft sql, mysql, mariadb",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/therac-25",
        "category":"dangerous software",
        "title":"Dangerous Software #1: Therac-25",
        "image":"https://tkouleris.eu/img/blog/therac-25.png",
        "date":"20 Oct. 2024",
        "content":"<p style=\"text-align: justify;\">\n                                            I remember many years ago, when I was a student, we had a discussion with\n                                            some computer science and electronics students. Most of them believed that\n                                            our professions weren’t that important and that a mistake you might make\n                                            wouldn’t cost someone their life. I disagreed back then and even brought up\n                                            the example of designing medical devices. I didn’t have a specific example\n                                            in mind, but in the end, my theory turned out to be true… and in fact, 15\n                                            years before I had that discussion with my classmates</p><br/>\n\n                                        <h3>The Therac-25</h3>\n                                        <p style=\"text-align: justify;\">\n                                            The Therac-25 was developed in the 1980s by the company AECL (Atomic Energy\n                                            of Canada Limited). It was the third model in a series of medical\n                                            radiotherapy machines and provided treatment through two modes of radiation:\n                                            electrons and X-rays. The system differed from previous models as it was the\n                                            first to rely so heavily on its software for safety, whereas earlier models\n                                            also used mechanical safety interlocks</p><br/>\n\n                                        <h3>How the software cost lives</h3>\n                                        <p style=\"text-align: justify;\">\n                                            The Therac-25 had serious software bugs that allowed excessively high doses\n                                            of radiation to be administered to patients. This occurred mainly due to the\n                                            following issues:</p>\n                                        <ul>\n                                            <li style=\"text-align: justify;margin-bottom: 10px;\">\n                                                <b>Software design failure:</b> The machine used a combination of software and\n                                                hardware to regulate radiation doses. However, the software contained\n                                                errors that could lead to overdoses without triggering the mechanical\n                                                safety systems.\n                                            </li>\n\n                                            <li style=\"text-align: justify;margin-bottom: 10px;\">\n                                                <b>Non-existent or insufficient safety checks:</b> The design of the Therac-25\n                                                included software that had not been adequately tested, and there were\n                                                not enough checks to ensure the machine was functioning properly. A\n                                                critical omission was the lack of compensating mechanical safety\n                                                mechanisms, as the system relied too heavily on the proper functioning\n                                                of the software.\n                                            </li>\n\n                                            <li style=\"text-align: justify;margin-bottom: 10px;\">\n                                                <b>Interaction with the operator:</b> The users of the Therac-25, typically\n                                                medical technicians, could unintentionally trigger the error by making\n                                                rapid changes to the machine's settings. Due to a bug in the keyboard\n                                                handling, the machine could start without the correct parameters for the\n                                                radiation.\n                                            </li>\n\n                                            <li style=\"text-align: justify;margin-bottom: 10px;\">\n                                                <b>Unclear and unhelpful error feedback:</b> When errors occurred, the machine\n                                                provided vague messages to the operators, which didn’t explain the risk.\n                                                The technicians didn’t understand the severity of the errors and often\n                                                ignored the messages.\n                                            </li>\n                                        </ul>\n\n                                        <p style=\"text-align: justify;\">\n                                            These problems had disastrous results. Between 1985 and 1987, at least six\n                                            incidents were recorded where patients received excessive radiation doses,\n                                            resulting in severe burns, permanent injuries, and in some cases, death. The\n                                            doses given to these patients were up to 100 times higher than the correct\n                                            therapeutic dose.</p><br/>\n\n                                        <h3>How we improved software since then?</h3>\n                                        <p style=\"text-align: justify;\">\n                                            The failure of the Therac-25 forced manufacturers to tighten the software\n                                            testing process, especially for software related to human life.</p>\n\n                                        <p style=\"text-align: justify;\">\n                                            Error codes now provide clear information to operators so they know exactly\n                                            what went wrong and why.</p>\n\n                                        <p style=\"text-align: justify;\">\n                                            The Therac-25 remains a cautionary example of the dangerous consequences of\n                                            inadequate design and insufficient testing in critical applications, and it\n                                            is often studied in software engineering schools.</p>\n                                        <iframe width=\"560\" height=\"315\"\n                                                src=\"https://www.youtube.com/embed/UXt5SG0qlR0?si=1ZXD5SeqjKhPO2Mv\"\n                                                title=\"YouTube video player\" frameborder=\"0\"\n                                                allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"\n                                                referrerpolicy=\"strict-origin-when-cross-origin\"\n                                                allowfullscreen></iframe><br/><br/>",
        "page":"therac-25",
        "description": "",
        "keywords": "dangerous software, therac-25, x-rays",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/isa-slots",
        "category":"forgotten technology",
        "title":"Forgotten Technology #4: ISA slots",
        "image":"https://tkouleris.eu/img/blog/forgotten_tech_4.jpg",
        "date":"13 Oct. 2024",
        "content":"<h3>ISA (Industry Standard Architecture) Slots: A Key Chapter in PC Evolution</h3>\n                                        <p style=\"text-align: justify;\">\n                                            ISA (Industry Standard Architecture) slots were a significant part of the history of personal computer (PC) evolution,\n                                            serving as a primary means for connecting various devices and expansion cards. Today, they have been replaced by newer\n                                            technologies, such as PCI and PCIe.\n                                        </p><br/>\n\n                                        <h3>What Are ISA Slots?</h3>\n                                        <p style=\"text-align: justify;\">\n                                            ISA slots are expansion slots found on motherboards that were primarily used during the 1980s and 1990s to connect external\n                                            cards and devices to computers. These cards included devices such as sound cards, graphics cards, network cards, and controllers\n                                            for external peripherals like printers and hard drives.\n                                        </p><br/>\n                                        <p style=\"text-align: justify;\">\n                                            Introduced in 1981 by IBM with the debut of the IBM PC, ISA architecture aimed to standardize the connection of additional\n                                            components inside the computer. This standardized architecture enabled widespread adoption by hardware manufacturers, making\n                                            it the dominant solution of its time.\n                                        </p><br/>\n\n                                        <h3>The Technology</h3>\n                                        <p style=\"text-align: justify;\">\n                                            The first version of ISA slots was 8-bit, meaning they could transfer data over 8-bit-wide paths. While sufficient for early\n                                            personal computers, growing demands highlighted the need for faster and wider data pathways. In response, the 16-bit version\n                                            of ISA was introduced in 1984, allowing more efficient data transfers and support for more demanding expansion cards.\n                                        </p><br/>\n                                        <p style=\"text-align: justify;\">\n                                            ISA slots had a relatively slow data transfer rate, ranging from 1 to 8 MB/s depending on the version. This slow speed became\n                                            a significant drawback as modern devices began requiring higher performance and faster data rates.\n                                        </p><br/>\n\n                                        <h3>The Use of ISA Slots</h3>\n                                        <p style=\"text-align: justify;\">\n                                            At their peak, ISA slots were the standard medium for connecting various peripheral devices. Numerous expansion cards, such\n                                            as Sound Blaster audio cards, graphics cards, SCSI controllers, and network cards, were designed for ISA slots.\n                                        </p><br/>\n                                        <p style=\"text-align: justify;\">\n                                            Their popularity stemmed from their broad compatibility and widespread support for many devices. However, as computers became\n                                            more powerful and device performance demands increased, the limitations of ISA technology became increasingly apparent.\n                                        </p><br/>\n\n                                        <h3>The Decline of ISA Slots</h3>\n                                        <p style=\"text-align: justify;\">\n                                            By the 1990s, ISA technology began to show its limitations as computers grew more powerful and user demands escalated.\n                                            Manufacturers started seeking alternatives offering better performance. This led to the introduction of PCI (Peripheral\n                                            Component Interconnect) in 1991, which provided significantly faster speeds and superior performance compared to ISA. PCI\n                                            slots allowed the connection of faster and more efficient devices, gradually rendering ISA obsolete.\n                                        </p><br/>\n                                        <p style=\"text-align: justify;\">\n                                            By the late 1990s, PCI slots had almost completely replaced ISA slots in most personal computers. Some motherboards continued\n                                            to include ISA slots into the early 2000s for compatibility with older devices, but their use eventually faded.\n                                        </p><br/>\n\n                                        <h3>Legacy and Significance</h3>\n                                        <p style=\"text-align: justify;\">\n                                            ISA slots played a pivotal role in the development of personal computers, enabling the expansion of their capabilities with\n                                            new devices and technologies. Although they have been replaced by more modern technologies such as PCI and PCIe, their historical\n                                            significance is undeniable. The development of ISA architecture laid a crucial foundation for subsequent advancements in computer\n                                            technology, contributing to the flexibility and functionality we enjoy today in modern PCs.\n                                        </p><br/>",
        "page":"isa-slots",
        "description": "ISA (Industry Standard Architecture) slots were a significant part of the history of personal computer (PC) evolution, serving as a primary means for connecting various devices and expansion cards. Today, they have been replaced by newer technologies, such as PCI and PCIe.",
        "keywords": "forgotten technology, isa slots, hardware",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/alan-turing",
        "category":"tech heroes",
        "title":"Tech Heroes #7: Alan Turing",
        "image":"https://tkouleris.eu/img/blog/alan-turing.jpg",
        "date":"06 Oct. 2024",
        "content":"                                        <p style=\"text-align: justify;\">\n                                            Alan Turing is rightly regarded as the father of computer science. Born on\n                                            June 23, 1912, he demonstrated an early talent for mathematics and the\n                                            sciences. He began solving mathematical problems even before acquiring the\n                                            necessary knowledge of advanced mathematics. Despite his exceptional\n                                            intelligence, he failed to secure a scholarship to Trinity College, his\n                                            first choice, but ultimately attended King’s College, Cambridge.\n                                        </p><br/>\n                                        <p style=\"text-align: justify;\">\n                                            As a student, Turing sought to solve David Hilbert's problem, which involved\n                                            investigating whether an algorithm could exist that, given a logical\n                                            expression as input, would always yield a correct YES or NO answer.\n                                        </p><br/>\n                                        <p style=\"text-align: justify;\">\n                                            Turing's solution was a hypothetical computing machine, which became known\n                                            as the Turing Machine. The Turing Machine, with an appropriate set of rules,\n                                            can perform various computations. Turing’s concept was that of a\n                                            general-purpose machine, limited only by computational resources such as\n                                            memory and processing power. All modern computers are fundamentally based on\n                                            the principles of the Turing Machine.\n                                        </p><br/>\n                                        <iframe width=\"560\" height=\"315\"\n                                                src=\"https://www.youtube.com/embed/dNRDvLACg5Q?si=407O48JgzHQiYoF-\"\n                                                title=\"YouTube video player\" frameborder=\"0\"\n                                                allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"\n                                                referrerpolicy=\"strict-origin-when-cross-origin\"\n                                                allowfullscreen></iframe>\n                                        <br/><br/>\n                                        <p style=\"text-align: justify;\">\n                                            During World War II, Turing devised a machine capable of decrypting messages\n                                            encoded by the German Enigma machine. Many historians suggest that the\n                                            decryption of these messages brought the war to an end several years earlier\n                                            than it otherwise might have.\n                                        </p><br/>\n                                        <p style=\"text-align: justify;\">\n                                            In 1948, Turing began developing a chess program for a computer that had not\n                                            yet been built. By 1949, he tackled the challenge of artificial intelligence\n                                            and proposed the famous Turing Test, which posits that a machine achieves\n                                            intelligence when its responses to questions are indistinguishable from\n                                            those of a human.\n                                        </p><br/>\n                                        <p style=\"text-align: justify;\">\n                                            Turing was openly homosexual at a time when homosexuality was a crime. He\n                                            was prosecuted and sentenced to hormonal treatments intended to suppress his\n                                            libido. Tragically, he died by suicide using cyanide in 1954.\n                                        </p><br/>\n                                        <iframe width=\"560\" height=\"315\"\n                                                src=\"https://www.youtube.com/embed/nuPZUUED5uk?si=G62l-kWPwrxQr4E7\"\n                                                title=\"YouTube video player\" frameborder=\"0\"\n                                                allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"\n                                                referrerpolicy=\"strict-origin-when-cross-origin\"\n                                                allowfullscreen></iframe>",
        "page":"alan-turing",
        "description": "Alan Turing is rightly regarded as the father of computer science. Born on June 23, 1912, he demonstrated an early talent for mathematics and the sciences. He began solving mathematical problems even before acquiring the necessary knowledge of advanced mathematics. Despite his exceptional intelligence, he failed to secure a scholarship to Trinity College, his first choice, but ultimately attended King’s College, Cambridge.",
        "keywords": "alan turing, tech heroes",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/cassete-tape",
        "category":"forgotten technology",
        "title":"Forgotten Technology #3: The cassete tape",
        "image":"https://tkouleris.eu/img/blog/forgotten_tech_3.jpg",
        "date":"29 Sept. 2024",
        "content":"<p style=\"text-align:justify\">Today, to listen to a song, all we need to do is\n                                            open YouTube, search for the title (or even lyrics if we don't remember the\n                                            title), and within seconds, we are listening to the tune that's been stuck\n                                            in our heads and we've been humming for the past 5 days. We can also, for\n                                            free or with a subscription, listen to almost any album or perhaps even the\n                                            entire discography of any band or artist. But 25 years ago, things were not\n                                            like this.</p><br/>\n\n                                        <p style=\"text-align:justify\">The cassette was a technology simple in its\n                                            conception. It was a small plastic casing containing a magnetic tape, on\n                                            which sound could be recorded, such as music, speech, or other sounds. The\n                                            tape was wound around two spools, and by moving the tape through the\n                                            cassette, sound could be recorded or played back.</p><br/>\n\n                                        <p style=\"text-align:justify\">There were many uses for it. From listening to\n                                            music recorded by a studio to capturing the inarticulate screams you made\n                                            with your friends to pass the time. However, the most common use was to make\n                                            a mixtape of different songs, which usually expressed feelings for someone\n                                            else and was intended as a gift for that person.</p><br/>\n\n                                        <p style=\"text-align:justify\">I admit that I never bought an original cassette\n                                            with music, because another common practice was to copy entire albums for\n                                            our friends, and they would do the same for others. Obviously, this was\n                                            something the record companies didn't want, but there was no technology at\n                                            the time to stop it.</p><br/>\n\n                                        <h3>The Use of Cassettes in Computers</h3>\n\n                                        <p style=\"text-align:justify\">Another use of cassettes was with computers. In\n                                            the 1980s, there was a significant rise in the home computer market. One of\n                                            the storage mediums... who am I kidding? The best way to play a game was to\n                                            find a pirated cassette with the game on it. There were external devices\n                                            that would read the magnetic tape of the cassette and transfer the data to\n                                            the computer's memory. Just like with floppy disks, except instead of\n                                            reading a magnetic disk, they read a magnetic tape.</p><br/>\n\n                                        <h3>The Walkman</h3>\n\n                                        <p style=\"text-align:justify\">However, without the cassette, we would never have\n                                            been able to carry music with us everywhere. So, in the late 70s, Sony gave\n                                            us a groundbreaking invention—the Walkman. I won't write much here since the\n                                            Walkman and its derivatives deserve an article of their own, but it's\n                                            important to note that the small size of the cassette helped in the\n                                            development of the Walkman. It certainly wouldn’t have been as easy to carry\n                                            around a portable turntable to listen to \"Battery\" by Metallica.</p><br/>\n\n                                        <p style=\"text-align:justify\">Although the audio cassette was hugely popular in\n                                            the 1980s and 1990s, with the rise of CDs and digital formats, its use\n                                            gradually declined. However, it remains a symbol of the analog era and music\n                                            culture.</p><br/>",
        "page":"cassete-tape",
        "description": "Today, to listen to a song, all we need to do is open YouTube, search for the title (or even lyrics if we don't remember the title), and within seconds, we are listening to the tune that's been stuck in our heads and we've been humming for the past 5 days. We can also, for free or with a subscription, listen to almost any album or perhaps even the entire discography of any band or artist. But 25 years ago, things were not like this.",
        "keywords": "forgotten technology, cassete, tape, cassete tape, hardware",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/three-things-for-programmers-to-avoid",
        "category":"misc",
        "title":"Three (3) things for programmers to avoid",
        "image":"https://tkouleris.eu/img/blog/misc.png",
        "date":"22 Sept. 2024",
        "content":"<p style=\"text-align:justify\">In the years I’ve worked as a programmer, I’ve\n                                            noticed, mostly in myself but also in other developers, various behaviors\n                                            that make us unproductive. These are usually either low self-esteem, fear of\n                                            the unknown, or arrogance, which create the problems. Human characteristics\n                                            that, as human experience has shown, when we master them, we make the world\n                                            better.</p>\n\n                                        <br/>\n                                        <h3>1. I need to learn everything to be a good programmer</h3>\n\n                                        <p style=\"text-align:justify\">This can happen when you start your journey as a\n                                            programmer. Slightly influenced by the countless movies showing programmers\n                                            as centers of knowledge and wisdom, and a bit by the huge amount of\n                                            technologies out there, you think you're too insignificant to become a\n                                            programmer or that you need to dedicate your life exclusively to it.</p>\n\n                                        <p style=\"text-align:justify\">When I finished school and was trying to find my\n                                            first job as a programmer, I read all the job listings and the skills\n                                            potential employers wanted me to have, and I broke into a cold sweat.\n                                            Technologies I had never heard of, terminology that was unknown and\n                                            incomprehensible. This was the reason I didn’t continue as a professional\n                                            programmer at that time and chose something simpler, like network\n                                            technician.</p>\n\n                                        <p style=\"text-align:justify\">However, if I had overcome my fears back then and\n                                            managed to find a job as a programmer, I would have faced another problem\n                                            that many beginners face—the imposter syndrome.</p>\n\n                                        <p style=\"text-align:justify\">And indeed, when I started working as a programmer\n                                            in 2016, for two years I thought I was just lucky and that soon they would\n                                            discover how incompetent I was and fire me. This anxiety made me try to\n                                            learn as much as possible. Learn WordPress, learn JavaScript, learn Laravel,\n                                            learn C and C++ (as if I needed them as a web developer), learn the\n                                            significance of every new buzzword I saw in the programming world.</p>\n\n                                        <p style=\"text-align:justify\">Fortunately, I soon realized that all I needed to\n                                            do was focus my attention on one language, one framework, and learn the\n                                            basic concepts and how I could apply them in my everyday work as a\n                                            programmer.</p>\n\n                                        <p style=\"text-align:justify\">As programmers, we need to understand that we\n                                            can't learn everything. Programming languages, frameworks, and technologies\n                                            are so numerous out there that even two lifetimes wouldn’t be enough to\n                                            learn them all. We only need to understand that all we need to learn are the\n                                            basics, the fundamentals. The client-server model, recursion, SOLID, design\n                                            patterns. These concepts are tied to a single technology or language but can\n                                            be applied across most technologies and languages.</p>\n\n                                        <br/>\n                                        <h3>2. I know everything, I am the best programmer</h3>\n\n                                        <p style=\"text-align:justify\">Fortunately, I have never met a programmer with\n                                            the arrogant behavior of the all-knowing who is always right. However, it is\n                                            another human behavior that we encounter in our daily lives, and sooner or\n                                            later, we will encounter it in our profession as well.</p>\n\n                                        <p style=\"text-align:justify\">At some point, we may acquire so much programming\n                                            knowledge that we begin to believe we are something special. This may even\n                                            be reinforced if, in the environment you work in, you always have the\n                                            answers and help others with their problems. However, it’s good not to have\n                                            illusions.</p>\n\n                                        <p style=\"text-align:justify\">We must always have an open mind and listen to the\n                                            opinion of someone who may not have the experience or the same knowledge as\n                                            we do. A good idea can come even from our local newsagent, who might have\n                                            nothing to do with programming. Rejecting an idea to insist on our own\n                                            superiority helps no one.</p>\n\n                                        <p style=\"text-align:justify\">More important than being right is the ability to\n                                            collaborate with others, and this cannot be done if you believe you are\n                                            always right or that your opinion is better than others. Collaboration\n                                            solves problems, and that's the only thing we want to do as programmers—to\n                                            solve problems.</p>\n\n                                        <br/>\n                                        <h3>3. This problem is impossible to solve, no one has ever solved it</h3>\n\n                                        <p style=\"text-align:justify\">Let’s say you’ve been working as a programmer for\n                                            some years, you have self-confidence (but not arrogance), and you are\n                                            presented with a problem you’ve never encountered before. It seems\n                                            impossible to implement, and you reject it. Congratulations, you just missed\n                                            an opportunity to become a better programmer.</p>\n\n                                        <p style=\"text-align:justify\">I understand the fear someone might have about the\n                                            unknown, but a programmer doesn’t exist to create simple CRUD applications.\n                                            After all, even an AI could do that today. A programmer is for the tough\n                                            problems. And these are the ones that improve him and make him better.</p>\n\n                                        <p style=\"text-align:justify\">Certainly, not all problems can be solved, but we\n                                            shouldn’t dismiss even the attempt to solve them. Before you say that you\n                                            cannot solve this problem, give it a try. See if others have solved it or\n                                            solved part of it. Ask another programmer if they have any ideas. Only when\n                                            you reach an absolute dead end should you admit defeat. It’s not a bad\n                                            thing. Then say that at this moment, this problem cannot be solved by\n                                            me.</p>\n\n                                        <p style=\"text-align:justify\">The process of solving it, or even admitting\n                                            defeat, takes you a step forward. It’s no small thing to break out of a\n                                            routine of creating simple CRUD applications and do what you were made\n                                            for—to solve real problems.</p>",
        "page":"three-things-for-programmers-to-avoid",
        "description": "In the years I’ve worked as a programmer, I’ve noticed, mostly in myself but also in other developers, various behaviors that make us unproductive. These are usually either low self-esteem, fear of the unknown, or arrogance, which create the problems. Human characteristics that, as human experience has shown, when we master them, we make the world better.",
        "keywords": "programming, skill",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/python-tutorial-4",
        "category":"python tutorial",
        "title":"Python Tutorial #4: Booleans",
        "image":"https://tkouleris.eu/img/blog/python.jpg",
        "date":"15 Sept. 2024",
        "content":"                                        <style>\n                                            body {\n                                                font-family: Arial, sans-serif;\n                                                line-height: 1.6;\n                                            }\n                                            pre {\n                                                background-color: #f4f4f4;\n                                                padding: 10px;\n                                                border-radius: 5px;\n                                                border: 1px solid #ddd;\n                                                overflow-x: auto;\n                                                color: #0b0b0b;\n                                            }\n                                            code {\n                                                font-family: Consolas, \"Courier New\", monospace;\n                                            }\n                                        </style>\n                                        <p style=\"text-align:justify;\">\n                                            Boolean values in Python are a data type that can only take two values: <code>True</code> or <code>False</code>.\n                                            These values are often used to control conditions in logical expressions, loops, and control structures such as\n                                            <code>if</code>, <code>while</code>, and <code>for</code> statements.\n                                        </p><br/>\n\n                                        <h3 style=\"text-align:justify;\">Characteristics of Booleans in Python</h3>\n                                        <ul>\n                                            <li style=\"text-align:justify;\">The type of Boolean values is <code>bool</code>.</li>\n                                            <li style=\"text-align:justify;\">In Python, comparisons, logical operations, and many other functions return Boolean values.</li>\n                                            <li style=\"text-align:justify;\">Everything can be evaluated as <code>True</code> or <code>False</code>:\n                                                Numbers: <code>0</code> is considered <code>False</code>, while any other number is <code>True</code>.\n                                                Lists, strings, and other containers: Empty ones are <code>False</code>, while non-empty ones are <code>True</code>.\n                                            </li>\n                                        </ul>\n                                        <pre><code>\n# boolean values\nx = True\ny = False\n\nprint( 5 > 3 ) # True\nprint(2 == 5 ) # False\n\nif x:\n    print(\"x value is True\")\nelse:\n    print(\"x value is False\")\n                                        </code></pre>\n                                        <p style=\"text-align:justify;\">\n                                            Boolean values are fundamental for controlling the flow of programs.\n                                        </p>",
        "page":"python-tutorial-4",
        "description": "Let's talk about booleans",
        "keywords": "python tutorial, python, programming, skill, booleans",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/python-tutorial-3",
        "category":"python tutorial",
        "title":"Python Tutorial #3: Lists, Tuples and sets",
        "image":"https://tkouleris.eu/img/blog/python.jpg",
        "date":"08 Sept. 2024",
        "content":"<style>\n                                            body {\n                                                font-family: Arial, sans-serif;\n                                                line-height: 1.6;\n                                            }\n                                            pre {\n                                                background-color: #f4f4f4;\n                                                padding: 10px;\n                                                border-radius: 5px;\n                                                border: 1px solid #ddd;\n                                                overflow-x: auto;\n                                                color: #0b0b0b;\n                                            }\n                                            code {\n                                                font-family: Consolas, \"Courier New\", monospace;\n                                            }\n                                        </style>\n                                        <h3 style=\"text-align:justify;\">Lists</h3>\n                                        <p style=\"text-align:justify;\">\n                                            A list in Python is a data structure used to store collections of elements in a specific order.\n                                            The elements in a list can be of any type, including numbers, strings, other lists, and other objects.\n                                            A list is mutable, which means its elements can be modified after creation.\n                                        </p>\n                                        <pre><code>\nmy_list = [1, 2, 3, 4, 5]\nanother_list = [\"apple\", \"banana\", \"cherry\"]\nmixed_list = [1, apple, True, 3.14]\n                                        </code></pre>\n                                        <ul>\n                                            <li style=\"text-align:justify;\">\n                                                You can access list elements using indexes, starting from <code>0</code> for the first element.\n                                                <pre><code>\nprint(my_list[0]) # prints: 1\nprint(another_list[2]) # prints: cherry\n                                                </code></pre>\n                                            </li>\n                                            <li style=\"text-align:justify;\">\n                                                You can modify list elements by assigning a new value to a specific index.\n                                                <pre><code>\nmy_list[1] = 10\nprint(my_list) # prints [1, 10, 3, 4, 5]\n                                                </code></pre>\n                                            </li>\n                                            <li style=\"text-align:justify;\">\n                                                You can add elements to a list using methods like <code>append()</code> to add an element at the end or <code>insert()</code> to add an element at a specific position.\n                                                <pre><code>\nmy_list.append(6)\nprint(my_list) # prints  [1, 10, 3, 4, 5, 6]\nmy_list.insert(2, \"new element\")\nprint(my_list) # prints [1, 10, 'new element', 3, 4, 5, 6 ]\n                                                </code></pre>\n                                            </li>\n                                            <li style=\"text-align:justify;\">\n                                                You can remove elements from a list using the <code>remove()</code> method (to remove a specific element) or the <code>pop()</code> method (to remove an element by index or the last element).\n                                                <pre><code>\nmy_list.remove(10)\nprint(my_list) # prints [1, 'new element', 3, 4, 5, 6]\n\nmy_list.pop(2)\nprint(my_list) # prints [1, 'new element', 4, 5, 6]\n\n                                                </code></pre>\n                                            </li>\n                                        </ul>\n                                        <br/>\n                                        <h3 style=\"text-align:justify;\">Tuples</h3>\n                                        <p style=\"text-align:justify;\">\n                                            A tuple in Python is a data structure similar to a list but with one key difference: tuple elements are immutable.\n                                            This means that once a tuple is created, you cannot change, add, or remove elements from it.\n                                            Tuples are used when you want to group data and ensure that it cannot be modified.\n                                        </p>\n                                        <pre><code>\nmy_tuple = (1, 2, 3)\nanother_tuple = (\"apple\", \"banana\", \"cherry\")\nmixed_tuple = (1, \"apple\", True, 3.14)\n                                        </code></pre>\n                                        <ul>\n                                            <li style=\"text-align:justify;\">\n                                                Like lists, you can access tuple elements using indexes.\n                                                <pre><code>\nprint(my_tuple[0]) # prints 1\nprint(another_tuple[2]) # prints cherry\n                                                </code></pre>\n                                            </li>\n                                            <li style=\"text-align:justify;\">\n                                                Tuple elements cannot be modified after creation. Any attempt to do so will result in an error.\n                                                <pre><code>\nmy_tuple[1] = 10 # it will cause a TypeError\n                                                </code></pre>\n                                            </li>\n                                        </ul>\n                                        <br/>\n                                        <h3 style=\"text-align:justify;\">Sets</h3>\n                                        <p style=\"text-align:justify;\">\n                                            A set in Python is a collection of unique elements without a specific order.\n                                            Unlike lists and tuples, sets do not allow duplicate elements, and their elements have no defined order.\n                                            These characteristics make sets ideal for situations where you need to store unique values and perform fast operations like unions, intersections, and differences.\n                                        </p>\n                                        <pre><code>\nmy_set = {1, 2, 3, 4}\nanother_set = {\"apple\", \"banana\", cherry\"}\nempty_set = set()\n                                        </code></pre>\n                                        <ul>\n                                            <li style=\"text-align:justify;\">\n                                                You can add elements to a set using the <code>add()</code> method.\n                                                <pre><code>\nmy_set.add(5)\nprint(my_set) # prints {1, 2, 3, 4, 5}\n                                                </code></pre>\n                                            </li>\n                                            <li style=\"text-align:justify;\">\n                                                You can remove elements using the <code>remove()</code> or <code>discard()</code> methods. The <code>remove()</code> method will raise an error if the element does not exist, while <code>discard()</code> will not.\n                                                <pre><code>\nmy_set.remove(3)\nprint(my_set) # prints {1, 2, 4, 5}\n                                                </code></pre>\n                                            </li>\n                                        </ul>",
        "page":"python-tutorial-3",
        "description": "Let's talk about lists, tuples and sets",
        "keywords": "python tutorial, python, programming, skill, lists, tuples, sets",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/greek-programmers-on-youtube",
        "category":"misc",
        "title":"Greek programmers on YouTube",
        "image":"https://tkouleris.eu/img/blog/greek-youtube-programmers.jpg",
        "date":"01 Sept. 2024",
        "content":"<p style=\"text-align:justify;\">\n                                            It’s true that Greek-speaking YouTube channels related to programming or developer topics are few compared to\n                                            English-speaking ones. However, this doesn’t mean there aren’t noteworthy efforts from Greece. Over the years,\n                                            I’ve found quite a few of them, and I’d like to share them in this post:\n                                        </p><br/>\n\n                                        <a href=\"https://www.youtube.com/@SocialNerdsGR\" target=\"_blank\"> <h3 style=\"text-align:justify;\">Social Nerds</h3></a>\n                                        <p style=\"text-align:justify;\">\n                                            One of the first channels I discovered when I started programming professionally. Initially, their content included\n                                            several tutorials and videos about developer culture, primarily from a professional perspective. Recently, the content\n                                            has shifted towards discussion-type videos on topics relevant to developers in the workplace.\n                                        </p><br/>\n\n                                        <a href=\"https://www.youtube.com/@CodeGRrow\" target=\"_blank\"> <h3 style=\"text-align:justify;\">CodeGRow</h3></a>\n                                        <p style=\"text-align:justify;\">\n                                            A relatively new channel that I stumbled upon during a TikTok infinite scroll session, and I’ve been following it ever since.\n                                            The content is primarily practical, focusing on tutorials. The videos are well-produced, with high-quality audio and visuals\n                                            that avoid the sense of amateurism often encountered. The creator puts effort into publishing these videos, and it shows.\n                                            Currently, CodeGRow is serving in the military but has promised to keep releasing content even during his service.\n                                        </p><br/>\n\n                                        <a href=\"https://www.youtube.com/@IoannisLilimpakis/videos\" target=\"_blank\"> <h3 style=\"text-align:justify;\">Ioannis Lilimpakis</h3></a>\n                                        <p style=\"text-align:justify;\">\n                                            Ioannis shares his experiences through his videos on interviews, certificates, events, and tools related to programming\n                                            and developers. He always provides his own perspective, grounding viewers in the Greek reality. While his videos are sporadic,\n                                            they’re worth watching for their raw and realistic content, which, in my opinion, resonates more authentically with everyday life.\n                                        </p><br/>\n\n                                        <a href=\"https://www.youtube.com/@mikrikouventa\" target=\"_blank\"> <h3 style=\"text-align:justify;\">Μικρή Κουβέντα (Small Talk)</h3></a>\n                                        <p style=\"text-align:justify;\">\n                                            Antonis and Paris, almost every week, host engaging discussions on topics related to IT and programming. The content becomes\n                                            even more exciting when they invite guests. Their videos are more in the form of podcasts, but for those who prefer visuals,\n                                            subscribing to their channel is a great option.\n                                        </p><br/>\n\n                                        <h3 style=\"text-align:justify;\">BONUS</h3>\n                                        <p style=\"text-align:justify;\">\n                                            The following two channels may not be in Greek, but they are run by Greeks and are worth mentioning for the quality of their content.\n                                        </p>\n\n                                        <ul>\n                                            <li style=\"text-align:justify;\">\n                                                <a href=\"https://www.youtube.com/@EleftheriaBatsou/featured\" target=\"_blank\"> <strong>Eleftheria Batsou:</strong></a> Recently, Eleftheria has been focusing on interviews with professionals in the field.\n                                                However, her channel also features various courses, talks, and rich content on other topics for developers, in addition to the interviews.\n                                            </li>\n                                            <li style=\"text-align:justify;\">\n                                                <a href=\"https://www.youtube.com/@nickchapsas\" target=\"_blank\"> <strong>Nick Chapsas:</strong></a> Although his channel is primarily about C# and .NET, it’s worth following him for the insights\n                                                and advice he offers, which can help you understand various programming concepts better.\n                                            </li>\n                                        </ul>\n",
        "page":"greek-programmers-on-youtube",
        "description": "Greek programmers invade YouTube",
        "keywords": "programmers, youtube, greeks, greek, greece, programming",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/are-video-games-waste-of-time",
        "category":"misc",
        "title":"Are video games a waste of time?",
        "image":"https://tkouleris.eu/img/blog/pac-man.jpg",
        "date":"25 Aug. 2024",
        "content":"<p style=\"text-align:justify;\">\n                                            In the minds of many, video games are still seen as something that only kids have the \"right\" to enjoy. For adults, they are often considered a waste of time. But is that really true?\n                                        </p>\n                                        <p style=\"text-align:justify;\">\n                                            Video games have evolved from two white pixels on a screen in the 1980s to today’s complex graphics with storylines that even Hollywood’s best screenwriters would envy. The depth and narrative quality of many modern games make it hard to dismiss them as mere children’s toys. In fact, there are several games based on real events that provide players with an opportunity to learn about human history while having fun.\n                                        </p>\n                                        <p style=\"text-align:justify;\">\n                                            If I had to answer the question of whether games are a waste of time with a single word, my answer would be <strong>no</strong>. But what exactly constitutes a waste of time? For example, someone might argue that reading books isn’t a waste of time, and society generally accepts that view. But the real question is: what books are being read? If someone reads books like <i>Little Red Riding Hood</i>, one could objectively say it’s a waste of time since it neither produces anything nor teaches anything new.\n                                        </p>\n                                        <p style=\"text-align:justify;\">\n                                            However, for every individual, even a seemingly trivial book, movie, or game can have meaning in their life. These are forms of entertainment, and depending on their content, they can either be truly enriching or remain at the level of simple amusement. Even lighthearted entertainment, though, is essential for some people to move forward in life with a little more ease.\n                                        </p>\n                                        <p style=\"text-align:justify;\">\n                                            There are times when we simply want to rest—to escape a bit without thinking, learning, or creating something. We just want to \"kill\" some time to relax. I believe this need is so essential that the so-called \"wasted\" time actually becomes an important tool for boosting productivity and creativity later on. From this perspective, it’s not wasted or lost time but rather a method to recharge and improve oneself.\n                                        </p>\n                                        <br/>\n                                        <h3 style=\"text-align:justify;\">When Can Something Be Considered a Waste of Time?</h3>\n                                        <p style=\"text-align:justify;\">\n                                            For me, wasted time is when you start something beneficial to you, do it once, twice, or three times, and then quit. For instance, say you decide to join a gym. You go three times, spending six hours of your life, but your body doesn’t show any change. Even then, it’s not necessarily wasted time if you do it consciously, recognizing that you’re simply taking some time to relax without fooling yourself into thinking you’re improving your fitness.\n                                        </p>\n                                        <p style=\"text-align:justify;\">\n                                            Wasted time, in my view, is when someone takes actions toward achieving a goal but gives up after a few attempts.\n                                        </p>\n                                        <br/>\n                                        <h3 style=\"text-align:justify;\">The Role of Addiction in Wasting Time</h3>\n                                        <p style=\"text-align:justify;\">\n                                            Another case where something can be considered a waste of time is addiction. Modern technology demands our attention. Our attention is the currency for apps like TikTok, YouTube Shorts, and similar platforms. These apps are designed to be addictive, making it easy to lose three hours without achieving anything, without even having fun, or recharging your mind. You’re simply inactive. Knowing when to stop scrolling is crucial.\n                                        </p>\n                                        <br/>\n                                        <h3 style=\"text-align:justify;\">Subjectivity and Personal Perspective</h3>\n                                        <p style=\"text-align:justify;\">\n                                            Ultimately, all of this is subjective. No one can define with precision what constitutes a waste of time for someone else. It all depends on the timing, the motivations, and the goals of the individual. Video games are not inherently a waste of time because they mean something different to everyone.\n                                        </p>",
        "page":"are-video-games-waste-of-time",
        "description": "Are video games a waste of time? Lets find out.",
        "keywords": "video games, waste of time",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/zacharias-den-to-ftiaxno",
        "category":"tech heroes",
        "title":"Tech Heroes #6: Zacharias DenToFtiaxno",
        "image":"https://tkouleris.eu/img/blog/code-monkey.jpg",
        "date":"11 Aug. 2024",
        "content":"<p style=\"text-align:justify;\">\n                                            Zacharias \"Den to Ftiaxno\" may not be globally renowned, but within the\n                                            programming circles of our small country, he is quite well-known. Zacharias\n                                            is the creation of a programmer, Sotiris Filippidis, who humorously captures\n                                            the everyday adventures of his character.\n                                        </p>\n                                        <p style=\"text-align:justify;\">\n                                            If you haven’t read the stories of Zacharias yet, you can visit the website\n                                            <i>Tria Kila Kodika</i> (<i>Three Kilos of Code</i>) to get to know both\n                                            Zacharias himself and the \"supporting cast\" of his tales. If you work in the\n                                            tech industry, you're almost guaranteed to find at least one story that\n                                            resonates with your own experiences.\n                                        </p><br/>\n                                        <h3 style=\"text-align:justify;\">The Social Nerds Interview</h3>\n                                        <p style=\"text-align:justify;\">\n                                            Sotiris Filippidis, aka Zacharias, recently gave an engaging interview on\n                                            the <b>Social Nerds</b> channel. To fully enjoy it, make sure you:\n                                        </p>\n                                        <ul style=\"text-align:justify;\">\n                                            <li>Have nothing important planned for the next two hours.</li>\n                                            <li>Grab some popcorn.</li>\n                                            <li>Relax and tune in.</li>\n                                        </ul>\n                                        <iframe width=\"560\" height=\"315\"\n                                                src=\"https://www.youtube.com/embed/mv7C5uXBepk?si=EWdEo2nM0FWefF8P\"\n                                                title=\"YouTube video player\" frameborder=\"0\"\n                                                allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"\n                                                referrerpolicy=\"strict-origin-when-cross-origin\"\n                                                allowfullscreen></iframe>",
        "page":"zacharias-den-to-ftiaxno",
        "description": "",
        "keywords": "tech heroes, zacharias, sotiris filippidis",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/modem",
        "category":"forgotten technology",
        "title":"Forgotten Technology #2: Modem",
        "image":"https://tkouleris.eu/img/blog/forgotten_tech_2_modem.png",
        "date":"28 July 2024",
        "content":"<p style=\"text-align:justify\">\n                                            Those who were lucky enough to grow up with internet at home, just like\n                                            having running water, often have no idea what a modem was. They haven’t\n                                            heard its sound, which we had associated with the very essence of the\n                                            internet, nor do they know the frustration of someone in the house wanting\n                                            to use the phone while the modem occupied the line to bring a picture of\n                                            Pamela from the latest Playboy to our computer (the motto being: the\n                                            internet is for porn).\n                                        </p><br/>\n\n                                        <h3>What Was a Modem?</h3>\n                                        <p style=\"text-align:justify\">\n                                            The modem (short for \"modulator-demodulator\") is a device used to transmit\n                                            data over telephone lines or other forms of telecommunication lines. The\n                                            modem converts digital signals from a computer into analog signals that can\n                                            be transmitted over telecommunication networks (a process known as\n                                            modulation) and, conversely, converts received analog signals back into\n                                            digital (a process known as demodulation).\n                                        </p><br/>\n\n                                        <h3>PSTN Modem</h3>\n                                        <p style=\"text-align:justify\">\n                                            If you had a landline, it was relatively easy to get internet access. Up\n                                            until about 2002, having internet required not only a landline but also an\n                                            internet subscription, which provided you with a combination of username,\n                                            password, a phone number, and of course, a modem to connect. From 2002\n                                            onwards (at least that’s when I noticed it), prepaid internet time cards\n                                            became available. These cards provided a phone number and a code, which,\n                                            with your modem, allowed you to connect to the internet.\n                                        </p>\n                                        <p style=\"text-align:justify\">\n                                            For those unfamiliar with how modems worked, it might sound strange that you\n                                            needed a phone number. The modem had to dial the phone number provided by\n                                            the internet service provider (ISP), which routed your connection to another\n                                            modem/server. Your modem and the ISP’s modem/server negotiated how the\n                                            signal would be transmitted via the phone line (the piercing sound you may\n                                            have heard was actually this negotiation), and then your computer became\n                                            part of the ISP’s network.\n                                        </p><br/>\n\n                                        <h3>ADSL Modem: Between Two Worlds</h3>\n                                        <p style=\"text-align:justify\">\n                                            In the summer of 2005, I got ADSL at home for the first time. It came as\n                                            part of an \"ADSL in a Box\" kit that included everything needed for the\n                                            setup, such as documents to send to the provider (in this case, Forthnet)\n                                            and an ADSL modem. This was a transitional period where even ISPs were\n                                            unsure how users would handle ADSL. This was because the ADSL modem was a\n                                            device that you connected to your computer via USB, plugged the phone line\n                                            into the modem, and used a Windows application to connect to the internet.\n                                            Naturally, only one person could use the internet at a time—unless you took\n                                            the time to figure out how to share the connection with other devices.\n                                        </p>\n                                        <p style=\"text-align:justify\">\n                                            Soon after, ADSL modem-routers emerged, offering both options: you could\n                                            connect the router as you would today or use the modem via USB with a\n                                            specific application. Personally, I never used the modem functionality of a\n                                            modem-router. Three months after my first ADSL connection, I bought a US\n                                            Robotics router so I could connect to the internet easily with Linux.\n                                        </p><br/>\n\n                                        <h3>Speed of Light</h3>\n                                        <p style=\"text-align:justify\">\n                                            The first time I used the internet from home was around 2001. At that time,\n                                            ADSL in Greece was still nonexistent, and the connection speed I could\n                                            achieve with a PSTN modem was 33.6Kbps—since I had an old modem gifted by a\n                                            friend. He had given it to me because he had upgraded to the peak modem of\n                                            the era: 56Kbps.\n                                        </p>\n                                        <p style=\"text-align:justify\">\n                                            While these speeds seem laughable today, back then, the internet's demands\n                                            weren’t exceedingly high. To give some perspective, the lowest ADSL speed at\n                                            the time was 384Kbps—nearly seven times faster than a 56Kbps modem but still\n                                            62 times slower than the maximum ADSL speed today, which now seems sluggish.\n                                        </p><br/>\n\n                                        <h3>Epilogue</h3>\n                                        <p style=\"text-align:justify\">\n                                            Many years have passed, and we’ve grown accustomed to uninterrupted internet\n                                            access. However, those of us who experienced it will never forget the sound\n                                            of the modem or the anticipation of waiting for late at night (when phone\n                                            rates were lower) to connect with our slow little modem. We’d eagerly browse\n                                            topics we were interested in, communicate, or play games. The modem is a\n                                            part of internet culture, as evidenced by the memes that occasionally\n                                            circulate, making us laugh and reminisce.\n                                        </p>",
        "page":"modem",
        "description": "Those who were lucky enough to grow up with internet at home, just like having running water, often have no idea what a modem was. They haven’t heard its sound, which we had associated with the very essence of the internet, nor do they know the frustration of someone in the house wanting to use the phone while the modem occupied the line to bring a picture of Pamela from the latest Playboy to our computer (the motto being: the internet is for porn).",
        "keywords": "forgotten technology, modem",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/floppy-disk",
        "category":"forgotten technology",
        "title":"Forgotten Technology #1: Floppy disk",
        "image":"https://tkouleris.eu/img/blog/forgotten_tech_1_floppy_disk.png",
        "date":"21 July 2024",
        "content":"<p style=\"text-align:justify\">\n                                            Before the Internet, DVD-ROMs, and CD-ROMs, the easiest and fastest way to\n                                            transfer data between computers was the floppy disk.\n                                            The floppy disk was a thin, flexible plastic object, either 3.5 inches or\n                                            5.25 inches in size, containing a magnetic disk inside its casing. Its\n                                            maximum storage capacity was 1.44 MB—barely enough to hold even one MP3\n                                            song. Back then, however, storage needs were much less demanding than they\n                                            are today.\n                                        </p><br/>\n\n                                        <h3>The Beginnings of the Floppy Disk</h3>\n\n                                        <p style=\"text-align:justify\">\n                                            The story of the floppy disk began in the 1960s. IBM was the first company\n                                            to develop and introduce the floppy disk in 1967, although its official\n                                            release occurred in 1971. The first floppy disk was 8 inches in diameter and\n                                            had a capacity of just 80 KB. Its major innovation was the ability to\n                                            rewrite data, a significant leap forward compared to the magnetic tapes used\n                                            at the time.\n                                        </p>\n\n                                        <p style=\"text-align:justify\">\n                                            The floppy disk evolved rapidly. In 1976, the 5.25-inch floppy disk was\n                                            introduced, quickly becoming the dominant storage medium for personal\n                                            computers. This smaller, more practical format offered capacities ranging\n                                            from 110 KB to 1.2 MB. These disks were widely successful throughout the\n                                            1980s and 1990s, serving as the primary medium for software installation and\n                                            data transfer.\n                                        </p>\n\n                                        <p style=\"text-align:justify\">\n                                            A major upgrade came in 1984 with Sony’s 3.5-inch floppy disk. With a hard\n                                            plastic casing for increased durability and initial storage capacities of\n                                            720 KB (later increasing to 1.44 MB), this version became the new standard,\n                                            remaining dominant for over a decade.\n                                        </p><br/>\n\n                                        <h3>Alternative Uses of Floppy Disks</h3>\n\n                                        <p style=\"text-align:justify\">\n                                            A unique innovation from Nintendo in the 1980s was the Famicom Disk System\n                                            in Japan, which exclusively used Nintendo-branded floppy disks. Gamers could\n                                            visit special kiosks to copy their desired games onto a disk, which could\n                                            then be played on their Nintendo systems.\n                                        </p>\n\n                                        <p style=\"text-align:justify\">\n                                            Nintendo’s floppy disks followed a similar design philosophy to computer\n                                            disks, featuring a plastic casing and a magnetic disk that could be\n                                            rewritten multiple times.\n                                        </p><br/>\n\n                                        <h3>Uses of the Floppy Disk</h3>\n\n                                        <p style=\"text-align:justify\">\n                                            Floppy disks were used for storing games, operating systems, and personal\n                                            files. In the early 1990s, many games required multiple disks—often four or\n                                            more. Users frequently needed to install games or software onto their large\n                                            1.2 GB hard drives (considered enormous at the time) using floppy disks.\n                                            Boot disks were another common use case, enabling a computer to start up\n                                            when needed.\n                                        </p>\n\n                                        <p style=\"text-align:justify\">\n                                            Even as late as the early 2000s, floppy disks were essential for students to\n                                            submit assignments to professors. Their affordability and small file sizes\n                                            made them convenient for such tasks.\n                                        </p><br/>\n\n                                        <h3>The Decline and End of the Floppy Disk</h3>\n\n                                        <p style=\"text-align:justify\">\n                                            Despite its popularity, the floppy disk began to lose ground in the late\n                                            1990s with the advent of CD-ROMs, which offered much larger storage\n                                            capacities (up to 700 MB) and faster data access. The introduction of USB\n                                            flash drives in the early 2000s dealt the final blow, providing even greater\n                                            capacities and transfer speeds.\n                                        </p>\n\n                                        <p style=\"text-align:justify\">\n                                            Computer manufacturers started phasing out floppy drives from new models,\n                                            and in 2011, Sony announced it would cease production of 3.5-inch floppy\n                                            disks. This marked the official end of the floppy disk era.\n                                        </p>\n\n                                        <p style=\"text-align:justify\">\n                                            <strong>Fun Fact:</strong> Younger generations might not realize it, but the\n                                            icon used for the \"Save\" button in many software programs is an image of a\n                                            floppy disk!\n                                        </p>",
        "page":"floppy-disk",
        "description": "Before the Internet, DVD-ROMs, and CD-ROMs, the easiest and fastest way to transfer data between computers was the floppy disk. The floppy disk was a thin, flexible plastic object, either 3.5 inches or 5.25 inches in size, containing a magnetic disk inside its casing. Its maximum storage capacity was 1.44 MB—barely enough to hold even one MP3 song. Back then, however, storage needs were much less demanding than they are today.",
        "keywords": "forgotten technology, floppy disk",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/bram-cohen",
        "category":"tech heroes",
        "title":"Tech Heroes #5: Bram Cohen",
        "image":"https://tkouleris.eu/img/blog/bram-cohen.jpg",
        "date":"03 May 2024",
        "content":"<p style=\"text-align:justify\">One of the most important figures in computer\n                                            science, who fundamentally changed the way files are shared, is Bram Cohen,\n                                            the creator of the immensely popular BitTorrent.</p>\n\n                                        <p style=\"text-align:justify\">Cohen began his journey in computer science at a\n                                            young age, as his father was a computer science teacher. Thus, programming\n                                            entered Bram's life early on through the then-famous programming language\n                                            BASIC, which was widely used for coding at the time.</p>\n\n                                        <p style=\"text-align:justify\">However, his greatest contribution to computer\n                                            science came much later. It was a time when the internet was gradually\n                                            becoming a part of everyone’s life. Back then, internet speeds were slow,\n                                            file sizes were large, and the demand for downloads was even greater. While\n                                            there were platforms like KaZaA for file transfers (both legal and illegal),\n                                            and FTP for mainly legal downloads, a significant problem persisted. If the\n                                            files were large and the demand for downloads high, as mentioned earlier,\n                                            download speeds would drop dramatically.</p>\n\n                                        <p style=\"text-align:justify\">To solve this problem, Cohen came up with an idea\n                                            that could be described as \"communistic.\" Anyone who wanted a file could\n                                            obtain it from multiple sources simultaneously. For example, if Byron and\n                                            Alice had the file and Kostas wanted to download it, he could download parts\n                                            of the file from both Byron and Alice at the same time. Once Kostas\n                                            completed his download and had the file on his disk, he would then become a\n                                            third node from which others could download the file.</p>\n\n                                        <p style=\"text-align:justify\">This approach distributed the load among all those\n                                            who had the file, improving download speeds. To achieve this, Cohen invented\n                                            BitTorrent. Essentially, BitTorrent is a small file that contains\n                                            information about where someone can find the file they want to download.\n                                            Using the earlier example, Kostas would first download this small file,\n                                            which would contain details about Byron and Alice. Once Kostas completed the\n                                            download, his information would also be added to the file for the next\n                                            person seeking the same download.</p>\n\n                                        <p style=\"text-align:justify\">The decentralized technology Cohen created is\n                                            still widely used today. It made transferring movies and music easier and\n                                            led to the rise of websites like The Pirate Bay.</p>",
        "page":"bram-cohen",
        "description": "One of the most important figures in computer science, who fundamentally changed the way files are shared, is Bram Cohen, the creator of the immensely popular BitTorrent.",
        "keywords": "tech heroes, bram cohen, bittorent, kazaa, file sharing",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/anonymous",
        "category":"tech heroes",
        "title":"Tech Heroes #4: Anonymous",
        "image":"https://tkouleris.eu/img/blog/anonymous.jpg",
        "date":"23 Feb. 2024",
        "content":"                                        <p style=\"text-align:justify\">Around 2008, the world was introduced to the\n                                            Anonymous for the first time. Initially, they were thought to be a group of\n                                            hackers aiming to attack the Church of Scientology, which was attempting to\n                                            intimidate people into removing videos that exposed the church's true\n                                            nature.</p>\n\n                                        <p style=\"text-align:justify\">But where did the Anonymous originate? Those less\n                                            familiar with internet culture might point to the obvious explanation widely\n                                            circulated by the media—that they emerged from the site 4chan. While this is\n                                            not incorrect, the true roots of the Anonymous go much further back, tied to\n                                            the culture and ideology of hackers.</p>\n\n                                        <p style=\"text-align:justify\">This ideology had existed almost from the\n                                            beginning. It traces back to the 1970s and 1980s, when hackers conducted\n                                            their early experiments in garages and freely shared information with the\n                                            world. The methods for creating new projects were openly available—either by\n                                            asking the creator directly or, later on, by reading Bulletin Board Systems\n                                            (BBS), which preserved such knowledge.</p>\n\n                                        <p style=\"text-align:justify\">This approach shaped the entire field of computer\n                                            science. Steve Wozniak showcased the first personal computer and met Steve\n                                            Jobs, with whom he would later found Apple. Other hackers, like Captain\n                                            Crunch, demonstrated techniques such as making free calls through the\n                                            American telephone system, uncovering and sharing the methods with\n                                            others.</p><br/>\n                                        <iframe width=\"560\" height=\"315\"\n                                                src=\"https://www.youtube.com/embed/n6TjjE8NHV0?si=0IPWfgZtyWEX8kZ7\"\n                                                title=\"YouTube video player\" frameborder=\"0\"\n                                                allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"\n                                                referrerpolicy=\"strict-origin-when-cross-origin\"\n                                                allowfullscreen></iframe>\n                                        <br/><br/>\n                                        <p style=\"text-align:justify\">It made no sense to those hackers to create\n                                            something they couldn’t share with others. They believed that information\n                                            should be free. This belief motivated them to develop new technologies.\n                                            Later, as networks began to emerge—not yet for the masses but for the few\n                                            passionate about technology—many found ways to access restricted information\n                                            and share it widely.</p>\n\n                                        <p style=\"text-align:justify\">These were the first hackers who became known to\n                                            the public, often seen as thieves. However, in 1986, Mentor, one of the most\n                                            renowned hackers today, wrote the <em>Hacker Manifesto</em>. In it, he made\n                                            it clear that hackers were not rebellious teenagers aiming to destroy the\n                                            world. They were ordinary people exploring new technologies and advocating\n                                            for free access to information. They didn’t care about religion, gender, or\n                                            race. Remaining anonymous behind their keyboards, they exchanged ideas and\n                                            knowledge.</p>\n                                        <iframe width=\"560\" height=\"315\"\n                                                src=\"https://www.youtube.com/embed/YvK7V7U5Mck?si=cegC5Xba35weIjcO\"\n                                                title=\"YouTube video player\" frameborder=\"0\"\n                                                allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"\n                                                referrerpolicy=\"strict-origin-when-cross-origin\"\n                                                allowfullscreen></iframe>\n                                        <br/><br/>\n                                        <p style=\"text-align:justify\">This core idea of freedom of speech, the\n                                            dissemination of information, and human knowledge is the driving force for\n                                            all hackers around the world. This freedom gave rise to free software,\n                                            Linux, and much of the technology we use today.</p>\n\n                                        <p style=\"text-align:justify\">All this freedom of speech finds fertile ground on\n                                            the internet. Anyone can express their opinion, conceal their identity, or\n                                            joke around. What surfaces on the internet—whether an idea, a technology, or\n                                            a meme—emerges from the democratic process that is inherent in the nature of\n                                            the internet.</p>\n\n                                        <p style=\"text-align:justify\">With this in mind, the Anonymous originated from\n                                            4chan, a controversial site, when someone in power tried to silence the\n                                            voices of the internet. Someone decided to impose silence on a medium that\n                                            cannot be silenced. Thus, the Anonymous began there, motivated by the\n                                            principle of freedom of speech. Are all Anonymous members technically\n                                            skilled hackers?</p>\n\n                                        <p style=\"text-align:justify\">To answer that, we need to examine the type of\n                                            hacking the Anonymous mainly engage in. Their primary method of protest\n                                            involves DDoS attacks—attacks where the goal is to overwhelm a server with\n                                            numerous requests, causing it to crash. In the real world, this is\n                                            comparable to gathering in Syntagma Square one afternoon with like-minded\n                                            individuals to protest pension reforms.</p>\n\n                                        <p style=\"text-align:justify\">It becomes clear that their basic methodology does\n                                            not require technical expertise but rather numbers. Therefore, anyone can be\n                                            part of the Anonymous. Of course, not all members are without the necessary\n                                            technical skills. Some, particularly those who bring hidden information\n                                            about governments and corporations to light via WikiLeaks, possess the\n                                            requisite expertise. However, the essence remains that anyone can protest\n                                            against injustice on the internet.</p>\n\n                                        <p style=\"text-align:justify\">The future of the Anonymous is unknown because\n                                            they have no leadership. They operate anarchically, without leaders, which\n                                            aligns perfectly with hacking culture. No one knows what lies ahead or how\n                                            long they will continue to exist. Nevertheless, they remain a distinctive\n                                            part of computer science. Their most recent intervention was a letter to\n                                            Benjamin Netanyahu regarding the war in Palestine.</p>\n                                        <iframe width=\"560\" height=\"315\"\n                                                src=\"https://www.youtube.com/embed/JCbKv9yiLiQ?si=ONWl5O64PpAaPhMp\"\n                                                title=\"YouTube video player\" frameborder=\"0\"\n                                                allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"\n                                                referrerpolicy=\"strict-origin-when-cross-origin\"\n                                                allowfullscreen></iframe>\n                                        <br/><br/>",
        "page":"anonymous",
        "description": "Around 2008, the world was introduced to the Anonymous for the first time. Initially, they were thought to be a group of hackers aiming to attack the Church of Scientology, which was attempting to intimidate people into removing videos that exposed the church's true nature.",
        "keywords": "tech heroes, anonymous, hackers",
        "year": 2024
    },
    {
        "url":"https://tkouleris.eu/blog/alan-cox",
        "category":"tech heroes",
        "title":"Tech Heroes #3: Alan Cox",
        "image":"https://tkouleris.eu/img/blog/alan-cox.jpg",
        "date":"26 Aug. 2023",
        "content":"<p style=\"text-align:justify\">Alan Cox is a British programmer who became\n                                            well-known among Linux enthusiasts for his contributions to the Linux kernel\n                                            and for embodying the stereotype of the long-haired, bearded hacker-wizard\n                                            often associated with programmer culture.</p>\n\n                                        <p style=\"text-align:justify\">Cox first encountered Linux while working at\n                                            Swansea University, where he installed an early version of the operating\n                                            system. In a real-world environment with multiple networked computers and\n                                            significant data traffic, Cox noticed numerous bugs. He fixed these by\n                                            rewriting much of the networking code. From that point onward, he dedicated\n                                            himself to the development of the Linux kernel.</p>\n                                        <br/>\n                                        <iframe width=\"560\" height=\"315\"\n                                                src=\"https://www.youtube.com/embed/J6r1qFNeDmQ?si=VadQxgyKuH6VzO5V\"\n                                                title=\"YouTube video player\" frameborder=\"0\"\n                                                allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"\n                                                referrerpolicy=\"strict-origin-when-cross-origin\"\n                                                allowfullscreen></iframe>\n                                        <br/><br/>\n\n                                        <p style=\"text-align:justify\">For a significant period, Cox was considered the\n                                            \"second-in-command\" of the Linux project, naturally behind Linus Torvalds.\n                                            Despite his prominent status, in 2009, he had a disagreement with Torvalds\n                                            and stepped down from his responsibilities within the project.</p>\n\n                                        <p style=\"text-align:justify\">Cox worked at Red Hat for a decade and later at\n                                            Intel until 2013, when he left everything to care for his ill wife, Telsa\n                                            Gwynne, who passed away in 2015.</p>",
        "page":"alan-cox",
        "description": "Alan Cox is a British programmer who became well-known among Linux enthusiasts for his contributions to the Linux kernel and for embodying the stereotype of the long-haired, bearded hacker-wizard often associated with programmer culture.",
        "keywords": "tech heroes, alan cox, hackers, open source",
        "year": 2023
    },
    {
        "url":"https://tkouleris.eu/blog/linus-torvalds",
        "category":"tech heroes",
        "title":"Tech Heroes #2: Linus Torvalds",
        "image":"https://tkouleris.eu/img/blog/linus-torvalds.jpg",
        "date":"16 July 2023",
        "content":"<blockquote>\n                                            Hello everybody out there using minix -\n\n                                            I’m doing a (free) operating system (just a hobby, won’t be big and\n                                            professional like gnu) for 386(486) AT clones.\n                                        </blockquote>\n                                        <p style=\"text-align:justify\">These were the words written by Linus Torvalds on\n                                            August 25, 1991, which changed the history of computing. At the time, he was\n                                            still a student, with no idea that he would change the world with this small\n                                            personal project, which he began as an effort to learn assembly language for\n                                            the 8086.</p>\n\n                                        <p style=\"text-align:justify\">Born in Finland, his first encounter with\n                                            computers came at the age of 11, using a Commodore VIC 20. He started coding\n                                            in BASIC. During his university studies, he was taught by Andrew Tanenbaum,\n                                            a name familiar to anyone who has studied computer science due to his hefty\n                                            books on networks and operating systems. Without him, Torvalds would never\n                                            have been inspired to start Linux, as his initial work was based on Minix,\n                                            an operating system developed by Tanenbaum in 1987.</p><br/>\n                                        <iframe width=\"560\" height=\"315\"\n                                                src=\"https://www.youtube.com/embed/SOXeXauRAm0?si=N0zTioBCxZMobPP9\"\n                                                title=\"YouTube video player\" frameborder=\"0\"\n                                                allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"\n                                                referrerpolicy=\"strict-origin-when-cross-origin\"\n                                                allowfullscreen></iframe>\n                                        <br/><br/>\n                                        <p style=\"text-align:justify\">The original name he wanted to give his operating\n                                            system was Freax, but thankfully, the FTP administrator who hosted the first\n                                            kernel of the system changed it to the now well-known Linux.</p>\n                                        <p style=\"text-align:justify\">Linux has since changed the course of computing,\n                                            as most servers and mobile phones run some version of its kernel. However,\n                                            it didn’t stop there. The need to manage the changes made by kernel\n                                            developers led Torvalds to another major achievement: the creation of the\n                                            widely used Git. Despite his immense success, Torvalds is well-known to\n                                            technology enthusiasts but not universally loved.</p>\n                                        <br/>\n\n                                        <iframe width=\"560\" height=\"315\"\n                                                src=\"https://www.youtube.com/embed/bw58LZTuZjA?si=eBBo9kv2EMXQMNeW\"\n                                                title=\"YouTube video player\" frameborder=\"0\"\n                                                allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"\n                                                referrerpolicy=\"strict-origin-when-cross-origin\"\n                                                allowfullscreen></iframe>\n                                        <br/><br/>\n                                        <p style=\"text-align:justify\">Despite his significant accomplishments, he is\n                                            infamous for clashes with other computing icons, such as Richard Stallman\n                                            (regarding the naming of Linux), and with major tech companies like NVIDIA.\n                                            Torvalds is not one to hold back, and like many brilliant minds in\n                                            computing, he has a tendency to be blunt, often coming across as rude to\n                                            people he considers foolish.</p><br/>\n                                        <iframe width=\"560\" height=\"315\"\n                                                src=\"https://www.youtube.com/embed/Efi9wa4Fwds?si=AaEnqAdqt71PUJdA\"\n                                                title=\"YouTube video player\" frameborder=\"0\"\n                                                allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"\n                                                referrerpolicy=\"strict-origin-when-cross-origin\"\n                                                allowfullscreen></iframe>\n                                        <br/><br/>\n                                        <p style=\"text-align:justify\">He is married to Tove Torvalds, a karate champion,\n                                            and they have three children. In 2010, he became a U.S. citizen and\n                                            identifies as an atheist and non-religious.</p>",
        "page":"linus-torvalds",
        "description": "Born in Finland, his first encounter with computers came at the age of 11, using a Commodore VIC 20. He started coding in BASIC. During his university studies, he was taught by Andrew Tanenbaum, a name familiar to anyone who has studied computer science due to his hefty books on networks and operating systems. Without him, Torvalds would never have been inspired to start Linux, as his initial work was based on Minix, an operating system developed by Tanenbaum in 1987.",
        "keywords": "tech heroes, linus torvalds, hackers, open source, linux, os, git",
        "year": 2023
    },
    {
        "url":"https://tkouleris.eu/blog/john-carmack",
        "category":"tech heroes",
        "title":"Tech Heroes #1: John Carmack",
        "image":"https://tkouleris.eu/img/blog/john-carmack.jpg",
        "date":"16 July 2023",
        "content":"<p style=\"text-align:justify\">The science of computing isn’t solely made up of\n                                            hackers writing code for \"serious\" applications and technologies—it also\n                                            includes those who brought computers into our everyday lives. One of these\n                                            individuals, known primarily in the gaming community, is John Carmack.</p>\n\n                                        <p style=\"text-align:justify\">You may not recognize his name, but you’ve likely\n                                            used one of his creations—his games. <i>Commander Keen</i>, <i>Wolfenstein\n                                                3D</i>, <i>Doom</i>, and <i>Quake</i> are just a few of his works. But\n                                            you might wonder, what does gaming have to do with computer science? The\n                                            answer is simple: games brought computers into most households.</p>\n\n                                        <p style=\"text-align:justify\">Until the mid-'90s, PCs were an expensive and\n                                            time-consuming hobby. In most parts of the world, people were reluctant to\n                                            spend so much money on gaming when consoles were far better suited to the\n                                            task. However, when <i>DOOM</i> debuted on PCs, it was revolutionary.\n                                            Consoles couldn’t match its capabilities, and the only way to experience its\n                                            full potential was on a PC. This increased demand, which in turn drove\n                                            prices down.</p>\n\n                                        <p style=\"text-align:justify\">Before Carmack reached the greatness of\n                                            <i>DOOM</i>, he wrote countless lines of code. He began developing his first\n                                            games for a magazine, where he met John Romero. At that time, smooth\n                                            scrolling on PCs was something no one had achieved, and NES games were\n                                            envied for their fluid scrolling. Unlike PCs, which were primarily designed\n                                            for tasks like Excel, NES consoles had the hardware to accomplish this.</p>\n\n                                        <p style=\"text-align:justify\">Carmack struggled but ultimately succeeded in\n                                            achieving smooth scrolling even on a PC. He was so excited about this\n                                            breakthrough that his first demo was the initial level from <i>Super Mario\n                                                Bros. 3</i>. He thought Nintendo would be interested, so he showed them\n                                            the demo, hoping to secure permission to create <i>Super Mario Bros. 3</i>\n                                            for PCs. However, Nintendo declined, wanting Mario to appear only on their\n                                            hardware for obvious reasons.</p>\n\n                                        <p style=\"text-align:justify\">Carmack’s achievement, smooth scrolling, led to\n                                            the creation of a new PC hero: <i>Commander Keen</i>. In this game, Carmack\n                                            utilized the technology he had developed, forever changing the landscape of\n                                            gaming on PCs.</p><br/>\n                                        <iframe width=\"560\" height=\"315\"\n                                                src=\"https://www.youtube.com/embed/mMbFExwqMYc?si=g8y5uUuTcs_P50Jm\"\n                                                title=\"YouTube video player\" frameborder=\"0\"\n                                                allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"\n                                                referrerpolicy=\"strict-origin-when-cross-origin\"\n                                                allowfullscreen></iframe>\n                                        <br/><br/>\n                                        <p style=\"text-align:justify\">However, this first achievement did not satisfy\n                                            his hunger, and soon gamers were enjoying a new game titled <i>Wolfenstein\n                                                3D</i>. In it, Carmack gave players the illusion of three-dimensional\n                                            space by using raycasting technology. This technique relies on a 2D map of\n                                            the area the player is navigating, and based on the player’s position and\n                                            viewing direction, it calculates distances and renders walls in the correct\n                                            proportions to appear 3D.</p>\n\n                                        <p style=\"text-align:justify\">His next project would leave the entire world in\n                                            awe and forever change gaming and computers. The phenomenon of <i>DOOM</i>\n                                            in 1992 was the result of implementing in real code a method that had\n                                            existed since the 1960s, known as Binary Space Partitioning (BSP). Using\n                                            this technology, he created yet another 3D game—though not truly 3D—that\n                                            left everyone speechless.</p>\n                                        <br/>\n                                        <iframe width=\"560\" height=\"315\"\n                                                src=\"https://www.youtube.com/embed/yTRzfKh4Tg0?si=F-rtbQ31BfSSe9BD\"\n                                                title=\"YouTube video player\" frameborder=\"0\"\n                                                allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"\n                                                referrerpolicy=\"strict-origin-when-cross-origin\"\n                                                allowfullscreen></iframe>\n                                        <br/><br/>\n                                        <p style=\"text-align:justify\">However, such a persistent programmer would\n                                            certainly not want to settle for something that was 3D but not truly 3D. So,\n                                            for the first time in 1996, with Carmack's blessing and his equally blessed\n                                            code, we all saw what true 3D on a PC really meant.</p>\n\n                                        <p style=\"text-align:justify\">With the money he earned from his discoveries, he\n                                            founded an aerospace company and collaborated with NASA. Recently, he has\n                                            been focused on virtual reality and the potential of Oculus Rift.</p>\n\n                                        <p style=\"text-align:justify\">John Carmack writes code non-stop. In fact, legend\n                                            has it that his ideal vacation is when he can isolate himself in a room with\n                                            his computer, so he can write code undisturbed.</p>\n\n                                        <p style=\"text-align:justify\">He is a strong advocate for open-source software,\n                                            and many of his creations have become open-source, allowing them to live on\n                                            for 20+ years after their creation. To understand what I mean, one can\n                                            simply play <i>Brutal Doom</i>.</p><br/>\n                                        <iframe width=\"560\" height=\"315\"\n                                                src=\"https://www.youtube.com/embed/IinYnj5CsPE?si=NW7JZa1CYC1Y2giL\"\n                                                title=\"YouTube video player\" frameborder=\"0\"\n                                                allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"\n                                                referrerpolicy=\"strict-origin-when-cross-origin\"\n                                                allowfullscreen></iframe>\n                                        <br/><br/>\n                                        <p style=\"text-align:justify\">At 47, he still has plenty of time to provide us\n                                            with more of his algorithmic achievements, especially in the field of\n                                            virtual reality, which he has been exploring in recent years.</p>",
        "page":"john-carmack",
        "description": "Carmack’s achievement, smooth scrolling, led to the creation of a new PC hero: Commander Keen. In this game, Carmack utilized the technology he had developed, forever changing the landscape of gaming on PCs.",
        "keywords": "tech heroes, john carmack, hackers, open source, doom",
        "year": 2023
    }
]
